{
    "intents": [
        {
            "intent": "greeting",
            "examples": [
                "Hi",
                "Hello",
                "Hey",
                "Good morning",
                "Good afternoon",
                "Good evening",
                "What's up"
            ],
            "responses": [
                "Hello! How can I assist you today?"
            ]
        },
        {
            "intent": "how_to_reach",
            "examples": [
             "how to reach?",
             "how to go?",
             "how can i reach?"
            ],
            "responses": [
                "You can use public vehicles, cabs, online ride sharing apps. Use navigation provided by our app"
            ]
        },
        {
            "intent": "ask_how_are_you",
            "examples": [
                "How are you?",
                "How are you doing?",
                "Tell me about you"
            ],
            "responses": [
                "I'm just a bot, but I'm here to help you!"
            ]
        },
        {
            "intent": "ask_name",
            "examples": [
                "What's your name?",
                "Who are you?"
            ],
            "responses": [
                "I'm WanderMate, your virtual assistant."
            ]
        },
        {
            "intent": "general guidelines",
            "examples": [
                "General guidelines",
                "guidelines", "guidelines to vistit world heritage sites",
                "any tips", "tourist guidelines"
            ],
            "responses": [
               "Respect local customs and avoid intrusive photography in religious or cultural settings.\n Always check for signage that might indicate restrictions on photography.\n Be mindful when photographing devotees or local people and ask for permission."
            ]
        },
        {
            "intent": "ask_capabilities",
            "examples": [
                "What can you do?",
                "What help can you provide?",
                "Can you help me?"
            ],
            "responses": [
                "I can help answer your questions and give you local info."
            ]
        },
        {
            "intent": "thank",
            "examples": [
                "Thank you",
                "Thanks",
                "tysm",
                "ty"
            ],
            "responses": [
                "You're welcome! If you have any more questions, feel free to ask."
            ]
        },
        {
            "intent": "nepali.phrases",
            "examples": [
               "nepali phrases",
               "local phrases",
               "local language",
               "phrase", "nepali"
            ],
            "responses": [
               "Namaste : Hello/Greetings",
               "Tapai lai kasto cha?: How are you",
               "Malai ramro cha: I'm fine",
               "Dhanyavad: Thank you",
               "Maaf garnus: Excuse me/Sorry",
               "Kati bajyo?: What time is it?",
               "Tapai ko nam k ho? :What is your name?",
               "Mero nam (yourname) ho: My name is (yourname)",
               "Subhakamana: Good luck/ Best wishes"
            ]
        },
        {
            "intent": "festivals_in_nepal",
            "examples": [
                "What are the major festivals in Nepal?", 
                "festivals", 
                "festival",
                 "festival in nepal",
                 "festivals in nepal",
                "Tell me about Nepalese festivals",
                "List some famous festivals celebrated in Nepal",
                "Which festivals are celebrated in Nepal?"
            ],
            "responses": [ "Dashain : The biggest Hindu festival in Nepal, celebrating the victory of good over evil. It lasts for 15 days and involves family gatherings, worship, and receiving blessings.\n  Tihar : Also known as the festival of lights, it is a five-day celebration that honors crows, dogs, cows, and brothers. Houses are decorated with oil lamps and rangoli. \n Holi: The festival of colors, celebrated with water balloons and colored powders, marking the arrival of spring. \n Teej: A festival for women, where they fast and pray for the well-being of their husbands or future spouses, dancing and singing traditional songs. \n Indra Jatra: A traditional festival in Kathmandu honoring Lord Indra, the god of rain, with chariot processions and masked dances. \n Buddha Jayanti: The birth anniversary of Gautama Buddha, celebrated by Buddhists across Nepal with prayers and rituals at monasteries.\n Maha Shivaratri : A Hindu festival dedicated to Lord Shiva, celebrated with night-long vigils, offerings, and visits to temples like Pashupatinath.\n Gai Jatra: A festival of humor and remembrance where families who lost loved ones during the year parade with decorated cows in Kathmandu.\n Maghe Sankranti: A harvest festival marking the transition of the sun into Capricorn, celebrated with traditional foods like sesame sweets and yams."
        ]
    },
           
        {
            "intent": "farewell",
            "examples": [
                "Bye",
                "See you later",
                "ttyl",
                "byebye",
                "see you"
            ],
            "responses": [
                "Goodbye! Have a great day!"
            ]
        },
        {
            "intent": "ask_about_nearby_restaurants",
            "examples":[ "restaurants", "restaurant", "where to eat?", "cafes", "lunch", "dinner", "breakfast", "eat", "food"
],
       "responses":[
        "There are a lot of restaurants in Kathmandu, Bhaktapur and Patan to try local nepali cuisine and international cuisine as well. You can use the map feature provided by our app to search nearby restaurants and cafes. It's better to go to local restaurants for better food experience."
       ]
        },
        {
            "intent": "introduce_kathmandu",
            "examples": [
                "Tell me about Kathmandu",
                "What is Kathmandu?",
                "kathmandu", 
                "ktm",
                 "capital city",
                "Give me some information about Kathmandu",
                "What is Kathmandu known for?"
            ],
            "responses": [
                "Kathmandu is the capital and largest city of Nepal, located in the Kathmandu Valley in the central part of the country. It's known for its rich history, diverse culture, and vibrant traditions. Kathmandu is also the gateway to the Himalayas, attracting tourists from all over the world."
            ],
            "follow_up_questions": [
                {
                    "intent": "more_about_kathmandu",
                    "examples": [
                        "more",
                        "details",
                        "tell me more",
                        "what else"
                    ],
                    "responses": [
                        "Kathmandu is one of the oldest continuously inhabited places in the world, founded in the 2nd century AD. The valley was historically called the Nepal Mandala (the name for the cosmic elements of water Dha mandala in Newari, and cosmos), and has been the home of the Newar people, a cosmopolitan urban civilization in the Himalayan foothills.[citation needed] The city was the royal capital of the Kingdom of Nepal and hosts palaces, mansions and gardens built by the Nepali aristocracy. It has been home to the headquarters of the South Asian Association for Regional Cooperation (SAARC) since 1985. Today, it is the seat of government of the Federal Democratic Republic of Nepal, established in 2008, and is part of Bagmati Province. Kathmandu is and has been for many years the centre of Nepal's history, art, culture, and economy. It has a multi-ethnic population within a Hindu majority. Religious and cultural festivities form a major part of the lives of people residing in Kathmandu. Tourism is an important part of the economy in the city. In 2013, Kathmandu was ranked third among the top ten upcoming travel destinations in the world by TripAdvisor, and ranked first in Asia. The city is considered the gateway to the Nepal Himalayas and is home to several World Heritage Sites: the Durbar Square, Swayambhu Mahachaitya, Bouddha and Pashupatinath.[9] Kathmandu valley is growing at 4 per cent per year according to the World Bank in 2010, making it one of the fastest-growing metropolitan areas in South Asia, and the first region in Nepal to face the unprecedented challenges of rapid urbanization and modernization at a metropolitan scale. It is the largest metropolitan area located in the Himalayas."
                    ]
                },
                {
                    "intent": "kathmandu.history",
                    "examples": [
                        "Tell me about the history of Kathmandu",
                        "What is the history of Kathmandu?",
                        "When was Kathmandu founded?",
                        "history"
                    ],
                    "responses": [
                        "Kathmandu has been the political and cultural heart of Nepal for centuries. It was historically a key center of trade and culture in the region, and it has served as the capital of various kingdoms. The city’s history dates back over 2,000 years and includes a rich blend of Hindu and Buddhist cultures."
                    ]
                },
                {
                    "intent": "kathmandu.climate",
                    "examples": [
                        "What is the climate like in Kathmandu?",
                        "Tell me about the weather in Kathmandu",
                        "What is the best time to visit Kathmandu?",
                        "climate"
                    ],
                    "responses": [
                        "Kathmandu has a temperate climate, with four distinct seasons: spring, summer, autumn, and winter. Summers (June–August) are warm and humid, with monsoon rains. Winters (December–February) are mild and dry, making it a great time to visit for sightseeing."
                    ]
                },
                {
                    "intent": "kathmandu.culture",
                    "examples": [
                        "Tell me about Kathmandu's culture",
                        "What are the cultural traditions in Kathmandu?",
                        "What is Kathmandu known for culturally?",
                        "culture"
                    ],
                    "responses": [
                        "Kathmandu is a melting pot of diverse cultures, with both Hindu and Buddhist influences. The city celebrates many festivals like Dashain, Tihar, and Teej. Kathmandu is also famous for its traditional music, art, and dance."
                    ]
                },
                {
                    "intent": "kathmandu.attractions",
                    "examples": [
                        "What are the top attractions in Kathmandu?",
                        "What should I visit in Kathmandu?",
                        "Tell me about the best places to see in Kathmandu",
                        "attractions"
                    ],
                    "responses": [
                        "Kathmandu is home to many must-see attractions like Swayambhunath Stupa (Monkey Temple), Pashupatinath Temple, Boudhanath Stupa, and Durbar Square. Thamel Market is a major tourist destination in Kathmandu too."
                    ]
                },
                {
                    "intent": "kathmandu.food",
                    "examples": [
                        "What is the food like in Kathmandu?",
                        "what should I eat?",
                        "Tell me about the cuisine in Kathmandu",
                        "What should I eat in Kathmandu?",
                        "foods",
                        "food"
                    ],
                    "responses": [
                        "Kathmandu is famous for its variety of traditional Nepali food, including dishes like momos (dumplings), dal bhat (lentil soup with rice), and sel roti (a traditional doughnut-like rice cake). The city has a vibrant food scene with influences from Tibetan, Indian, and Newar cuisines."
                    ]
                }
            ]
        },
        
        {
            "intent": "world_heritage_sites_kathmandu",
            "examples": [
                "What are the World Heritage Sites in Kathmandu?",
                "Tell me about Kathmandu's UNESCO World Heritage Sites",
                "Which UNESCO sites are located in Kathmandu?",
                "world heritage site", "cultural sites", "unesco",
                "kathmandu world heritage sites", "world heritage sites"
            ],
            "responses": [
                "Kathmandu is home to several UNESCO World Heritage Sites, including:\n\n1. **Kathmandu Durbar Square**: A historic royal palace complex located in the heart of Kathmandu. It includes the **Hanuman Dhoka Palace**, **Kumari Ghar** (the residence of the living goddess), and **Kasthamandap** (a wooden pavilion). The square is culturally significant, serving as the political and cultural heart of the city for centuries.\n\n2. **Swayambhunath Stupa (Monkey Temple)**: A sacred Buddhist site with panoramic views of the city. It features a large stupa with the eyes of Buddha and is surrounded by shrines, statues, and numerous monkeys. The site is a spiritual retreat and a significant landmark for both Buddhists and Hindus.\n\n3. **Boudhanath Stupa**: One of the largest Buddhist stupas in the world, located in the northeastern part of Kathmandu. It has a large white dome and gold spire, surrounded by monasteries, prayer wheels, and Tibetan shops. It is an important center for Tibetan Buddhism and a major pilgrimage site.\n\n4. **Pashupatinath Temple**: A revered Hindu temple complex dedicated to Lord Shiva, located on the banks of the Bagmati River. It includes cremation ghats and is considered one of the holiest Hindu sites. The main temple, a pagoda-style structure, houses the sacred Pashupatinath idol.\n\n5. **Bhaktapur Durbar Square**: Located in Bhaktapur, just outside Kathmandu, this square features medieval architecture and historical buildings, including the **Vatsala Temple**, **55-Window Palace**, and the **Bhairab Nath Temple**. It showcases the cultural richness of the Malla period.\n\n6. **Patan Durbar Square**: Situated in the city of Patan, this square is famous for its intricate temples, including the **Mahabouddha Temple** and the **Golden Temple**. The square reflects the artistry of the Malla kings and is known for its fine stonework and carvings.\n\n7. **Changu Narayan Temple**: Located in Bhaktapur, this Hindu temple dedicated to Lord Vishnu is believed to be the oldest Hindu temple still in use. It features ancient inscriptions, a pagoda-style architecture, and beautifully crafted woodwork, making it a significant site for historical and religious studies.\n\nEach of these sites holds great cultural, religious, and historical importance. They showcase the rich heritage of Nepal and are visited by people from around the world for both spiritual purposes and historical exploration."
            ]
        },
        {
            "intent": "durbar_squares",
            "examples": ["durbar squares", "what are the durbar squares in kathmandu", "durbars in kathmandu", "durbar square"
        ],
        "responses" :["The three durbar squares in Kathmandu valley are Bhaktapur Durbar Square, Patan Durbar Square and Kathmandu Durbar square."
    ]
        },
        {
            "intent": "hiking_spots_kathmandu",
            "examples": [
                "What are the best hiking spots near Kathmandu?",
                "Where can I hike around Kathmandu?", "hiking",
                "Suggest some hiking destinations near Kathmandu", 
                "adventurous spots", 
                "hiking spots"
            ],
            "responses": [
                "Kathmandu offers access to stunning hiking trails and adventurous spots. Popular hiking spots near the city include: \n1. Champadevi, Hiking to Swayambhu, Shivapuri national park. Canyoning in sundarijal, Paragliding in godavari are other adventurous spots in Kathmandu"
            ]
        },
        {
            "intent": "introduce_bhaktapur",
            "examples": [
                "Tell me about Bhaktapur", "baktapur",
                "What is Bhaktapur?",
                "Give me some information about Bhaktapur",
                "Bhaktapur"
            ],
            "responses": [
                "Bhaktapur is a historic city in the Kathmandu Valley, known for its well-preserved medieval architecture and rich cultural heritage. It is home to Bhaktapur Durbar Square, a UNESCO World Heritage Site."
            ],
            "follow_up_questions": [
                {
                    "intent": "more",
                    "examples": [
                        "Tell me more about Bhaktapur",
                        "Give me more information",
                        "What else can you tell me about Bhaktapur?",
                        "more"
                    ],
                    "responses": [
                        "Bhaktapur, an anciently choreographed city, moreover, is also designated as an open museum. Over hereabouts, you can catch sight of the marvelous erections up until the last 18th century.  Amidst them, the then Royal Palace is one of the most attractive temptations of Bhaktapur Durbar Square. It is said that the first palace in the current Durbar area was built by King Jayasthiti Malla, in the late 13th century."
                    ]
                },
                {
                    "intent": "Bhaktapur_durbar_square",
                    "examples": [
                        "Tell me about Bhaktapur Durbar Square.",
                        "What can I see in Bhaktapur Durbar Square?",
                        "Describe Bhaktapur Durbar Square.",
                        "bhaktapur durbar square"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square is one of the most iconic and well-preserved historic sites in the Kathmandu Valley, located in Bhaktapur, just a few kilometers from Kathmandu. The square is a UNESCO World Heritage Site, celebrated for its stunning architecture and cultural significance. The square was once the royal palace complex of the Malla kings, serving as the political and cultural center of the city for centuries."
                    ]
                },

                {
                    "intent": "Bhaktapur.architecture",
                    "examples": [
                        "How does Bhaktapur Durbar Square reflect Newari architecture?",
                        "bhaktapur architecture",
                        "architecture"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square reflects Newari architecture through its intricate woodwork, fine carvings, and pagoda-style roofs. Wooden Carvings: Newari architecture is known for its intricate woodcarvings. In Bhaktapur, you'll find wooden windows, doors, struts, and beams adorned with detailed motifs and figures from Hindu and Buddhist mythology.Pagoda-Style Temples: Pagoda-style architecture is a hallmark of Newari temple design."
                    ]
                },
                {
                    "intent":"Bhaktapur.food",
                    "examples": [
                        "food", "what to eat in bhaktapur?", "bhaktapur foods"
                    ],
                    "responses":[
                        "Traditional Delicacies are Samay Baji : A ceremonial platter consisting of beaten rice (chiura), buffalo meat, boiled eggs, black soybeans, and pickled vegetables, served as an auspicious dish in Newari feasts. \n Bara : Savoury lentil pancakes, made from black gram batter, fried to perfection, and often topped with eggs or minced meat. \n Chatamari : A thin, crispy rice flour crepe, often referred to as (Newari pizza) topped with eggs, minced meat, and spices, offering a delightful blend of textures and flavours. \n Choila : Spiced and grilled buffalo meat, marinated with mustard oil, garlic, and chilli, offering a bold and smoky flavour.\n Sapu Mhicha : A unique Newari speciality made of buffalo leaf tripe stuffed with bone marrow, slow-cooked for a melt-in-the-mouth texture.\n Yomari : A festival-exclusive steamed rice dumpling filled with a mixture of jaggery and sesame seeds, enjoyed during Yomari Punhi."
                    ]
                },
                {
                    "intent": "Bhaktapur.palace",
                    "examples": [
                        "What is the purpose of the 55-Window Palace?",
                        "55 window palace", "museum",
                        "55 jhyale"                     ],
                    "responses": [
                        "The 55-Window Palace was the royal residence during the Malla kings' reign and remains an architectural landmark in Bhaktapur. It is famous for its intricately carved wooden windows and doors, which are significant examples of Newari craftsmanship.One of the most stunning buildings in the durbar square is the Palace with Fifty-Five Windows. This palace was built by King Bhupatindra Malla in 1677. The Palace of 55 (Fifty-Five) Windows got its name from the façade's fifty-five intricately carved wooden windows. This palace is constructed around a number of interconnected interior courtyards. According to legend, there were initially 99 courtyards, but currently there are just nine. The 'Golden Gate' main entrance gate is another outstanding feature of this palace. In the early eighteenth century, King Jayastithi Malla later erected this gate to the palace. Metal embossed with gold plating is used to embellish this gate. It leads to the palace's entrance courtyard."
                    ]
                },
                {
                    "intent": "Bhaktapur.festivals",
                    "examples": [
                        "How do traditional festivals impact Bhaktapur Durbar Square?", 
                        "festivals", "festival", "tradition", "culture", "culture and tradition"
                    ],
                    "responses": [
                        "Traditional festivals, such as Bisket Jatra, Gai Jatra, Indra Jatra bring the community together and help preserve the cultural heritage of Bhaktapur Durbar Square."
                    ]
                },
                {
                    "intent": "bisket.jatra",
                    "examples": [
                       "Bisket Jatra"
                    ],
                    "responses": [
                        "Bisket Jatra is the nepali new year festival.It is mostly celebrated in newari communities. It is a grand celebration where a massive chariot of Lord Bhairab is pulled through the streets. It involves tongue-piercing rituals and a famous tug-of-war between the chariot teams."
                    ]
                },
                {
                    "intent": "gai.jatra",
                    "examples": [
                       "Gai Jatra"
                    ],
                    "responses": [
                        "Gai jatra is festival of cows. Families who have lost loved ones participate in a procession with cows or dressed-up children.It is a mix of remembrance, humor, and satire in Newar society."
                    ]
                },
                {
                    "intent": "indra.jatra",
                    "examples": [
                       "indra Jatra"
                    ],
                    "responses": [
                        "Indra Jatra: Honoring Lord Indra (god of rain) with masked dances and religious processions." ]
                    },
                
                {
                    "intent": "vatsala.temple",
                    "examples": [
                        "What is the architectural style of the Vatsala Temple?",
                        "vatsala temple",
                        "temples in bhaktapur", "temples", "temple"
                    ],
                    "responses": [
                        "The Vatsala Temple showcases traditional Newari architecture with its finely crafted wooden windows and intricate carvings.The Vatsala Durga (also known as the Vatsala Devi) is located on the east side of the Bhaktapur Darbar Square. It is a sikhara-style monument dedicated to the Vatsala manifestation of the female deity Durga. The temple was the third Vatsala temple constructed in Bhaktapur's Darbar Square, following two earlier temples constructed by King Jitamitra Malla (r. 1663-96). The first temple is a miniature shrine located behind the Pashupatinath temple; the second was constructed behind the Siddhi Lakshmi temple but was destroyed in the 1934 earthquake. The third temple, shown in this series of images, was likely built late in the 1690s, but the precise date is unknown. The only date that can be fixed is the replacement of the temple's bell in 1721, suggesting that the temple had already existed long enough for the original bell to require replacement"
                    ]
                },
                {
                    "intent": "ask_about_bhairavnath_temple",
                    "examples": [
                        "What is the significance of the Bhairavnath Temple?",
                        "bhairavnath",
                        "bhairavnath temple"
                    ],
                    "responses": [
                        "The Bhairavnath Temple is dedicated to Lord Bhairav, one of the fiercest deities in Hinduism, and is an important religious site in Bhaktapur.Bhairavanath temple is one sacred temple of Bhaktapur that lies at the central square of Bhaktapur, Taumadhi Square. This temple devoted to lord bhairava is one of the rectangular based temples of Bhaktapur. One could easily recognize this temple as it lies right behind the giant Nyatapola temple."
                    ]
                },
                {
                    "intent":"Bhaktapur.location",
                    "examples":[ "location", "where is bhaktapur durbar square located?"],
                    "responses":[
                        "The ancient city Bhaktapur lies on the Eastern part of Kathmandu valley which is also known as Bhadgaon or Khwopa, Bhaktapur. It is regarded as the abode of traditional Nepali culture, custom and unique arts of wooden and potteries. The historical monument on around signifies medieval age culture and tradition of Nepal and this old city is inhabited by indigenous Newari people in large group. The main attractive monuments are Nyatapola Temple, statue of King Bhupatindra Malla, Peacock Window, Golden Gate and fifty-five windowed palace of Bhaktapur Durbar Square."
                    ]
                },
                {
                    "intent": "openinghours.entryfee",
                    "examples": [
                        "What are the opening hours of Bhaktapur Durbar Square?",
                        "opening hours",
                        "How much is the entry fee for Bhaktapur Durbar Square?",
                        "entry fee", "entry fees",
                        "Is Bhaktapur Durbar Square accessible for disabled visitors?", "opening hours and entry fee", "visiting hours", "opening time"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square is open to visitors 24/7 for general strolling. However, to access major sites like museums and galleries within the square, tickets are required. The ticket counters operate from 7:00 AM to 7:00 PM daily. \n Entry Fees: Foreign Nationals: NPR 1,800 \n SAARC Nationals: NPR 500 \n Chinese Nationals: NPR 500 \n Nepalese Citizens: Free"
                    ]
                },
                {
                    "intent": "ask_about_nyatapola_temple",
                    "examples": [
                        "What makes the Nyatapola Temple unique?",
                        "nyatapola temple",
                        "nyatpola temple", "temples"
                    ],
                    "responses": [
                        "The Nyatapola Temple is the tallest pagoda-style temple in Nepal and is famous for its five tiers and impressive architecture.Nyatapola is a five-storeyed ancient temple that makes each Bhaktapurians feel so proud. People may have very little knowledge about Bhaktapur city. But, within that tatter of knowledge, they put a page where the mysterious stories of Nyatapola always breathe. Explaining its accessories. There are 5 Ganesha, 5 tiers, 5 plinths, 33 steps, 108 struts, and 360 battens used in the temple. Whereas, all these numbers have a significant role in tantrism."
                    ]
                },
                {
                    "intent": "ask_about_peacock_window",
                    "examples": [
                        "What is the story behind the Peacock Window?",
                        "peacock window"
                    ],
                    "responses": [
                        "The Peacock Window is an intricately carved wooden window that symbolizes the artistic excellence of Newari craftsmanship in Bhaktapur."
                    ]
                },
                {
                    "intent": "ask_about_preservation",
                    "examples": [
                        "What efforts are being made to preserve Bhaktapur Durbar Square?",
                        "preservation", "protection"
                    ],
                    "responses": [
                        "Restoration projects, funded by both local and international organizations, are ongoing to repair the structures damaged by time and disasters."
                    ]
                },
                {
                    "intent": "ask_about_earthquake_impact",
                    "examples": [
                        "How did the 2015 earthquake impact Bhaktapur Durbar Square?",
                        "earthquake"
                    ],
                    "responses": [
                        "The 2015 earthquake caused significant damage to several structures in Bhaktapur Durbar Square, including temples, shrines, and monuments."
                    ]
                },
                {
                    "intent": "ask_about_pottery_square",
                    "examples": [
                        "What is Pottery Square famous for?", "where to do pottery?", "pottery in bhaktapur", "pottery"
                    ],
                    "responses": [
                        "Pottery Square is renowned for its traditional pottery-making, where artisans create various clay products that are sold to locals and tourists.ottery Square in Bhaktapur, Nepal, is a vibrant hub of culture, craft, and creativity. It’s a place where the traditional art of pottery is still alive and thriving, with local artisans shaping clay into various forms, from pots and vases to intricate sculptures.Use maps to see pottery square."
                    ]
                },

                {
                    "intent": "ask_about_lions_gate",
                    "examples": [
                        "lions gate",
                        "lion gate"
                    ],
                    "responses": [
                        "The Lion's Gate is a historical entrance to Bhaktapur Durbar Square, known for its detailed sculptures of lions that protect the entrance.The Lion Gate is a 17th-century structure, created with the belief that it will protect the ancient city. The gate has two large and majestic lion statues placed on either side. The Lion Gate is located inside the Bhaktapur Durbar Square along with several other ancient buildings and artefacts, which is accessible through many well-maintained pathways. Popular belief holds the King to have chopped off the hands of the artisans who built the Lion Gate, an attempt to ensure that to Lion Gate would never be replicated."
                    ]
                },
                {
                    "intent": "ask_about_newari_culture",
                    "examples": [
                        "How is Newari culture preserved in Bhaktapur?",
                        "newari culture",
                        "culture in bhaktapur",
                        "bhaktapur culture"
                    ],
                    "responses": [
                        "Newari culture is preserved in Bhaktapur through the maintenance of historical buildings, traditional crafts, and cultural practices.Bhaktapur is a “Living Heritage” or “Living Museum” displaying the vibrant depth of Newari culture. Great festivals of local Newars, their life style, rituals, Daffas (prayers group) and Guthis and traditional dance groups are giving life to the intangible heritage of the city."
                    ]
                },
                {
                    "intent": "bhaktapur_major.attraction",
                    "examples": [
                        "What is bhaktapur famous for?",
                        "bhaktapur popularity",
                        "famous bhaktapur", "places to visit",
                        "tourist activities", "tourist attractions", 
                        "tourist site", "attractions", "attraction",
                        "major attraction", "major attractions"
                    ],
                    "responses": [
                        "Bhaktapur is also famous for its cuisine with the jūjū dhau, a type of yogurt made from buffalo milk being the most popular. Bhaktapur's potters and handicraft industries are also known nationwide.Major attractions are 55 window palace,Lions gate, architecture, pottery, peacock window, temples like Vatsala temple, Siddhi Laxmi temple, Nyatapola Temple, Bhairavnath Temple, Taleju Bhawani temple"
                    ]
                },
                {
                    "intent": "ask_about_siddhi_laxmi_temple",
                    "examples": [
                        "What is the history behind the Siddhi Laxmi Temple?",
                        "siddhi laxmi temple",
                        "laxmi temple",
                        "siddhi"
                    ],
                    "responses": [
                        "Siddhi Lakshmi Temple is one of three shikara-style temples built in Bhaktapur square, and one of only two surviving examples (the third, the Silumahadeva, was destroyed in the 1934 earthquake, while the second, the Vatsala Devi, still stands). It honors Siddhi Lakshmi, a patron deity of the Malla Kings. The goddess was believed to have the power to drive away evil spirits and negative forces, and in this sense, served as a protector. As she represents one of the manifestations of the wrathful goddess Durga, various bas-reliefs of Durga are mounted above the temple's entrance and on its sides.The temple is located immediately to the southeast of the so-called 55-Window Palace. It stands upon a seven-tier diminishing plinth, shaped like a low stepped pyramid. Entry is from the south side, with the path up the plinth lined with 10 superb sculptures of humans, animals (horses, dogs, rhinos), and various fanatical animals (mythical figures and sloth bears). Van der Geer notes that the rhinoceroses are chained, but whether that is proof of any kind of use, be it in war or to plow the fields, is very uncertain. (Van der Geer, p. 385). This motif—a pathway lined with animals and human figures—is unusual in the valley apart from sites in Bhaktapur. Hutt notes that Slusser suggests [this] may reflect a measure of Chinese influence (Hutt, p. 127). Hutt further notes that Bhaktapur is the last major Newar town on the old land route to Beijing, though that does not definitively settle whether Chinese influence is actually expressed here.The temple was substantially damaged in the 2015 earthquake but remained standing in a precarious condition. Temporary wooden scaffolding was employed to reinforce the structure, which was in imminent danger of collapse. The conservators dismantled the temple—stone by stone—and rebuilt it to stabilize stones that had shifted and added seismic reinforcement. The project cost roughly $140K USD. After the reconstruction was completed, the image of the deity was moved back into its original position within the temple's inner sanctum."
                    ]
                },
                {
                    "intent": "ask_about_taleju_bhawani_temple",
                    "examples": [
                        "What is the significance of the Taleju Bhawani Temple?",
                        "taleju bhawani",
                        "taleju"
                    ],
                    "responses": [
                        "The Taleju Bhawani Temple is dedicated to the goddess Taleju, a protector deity worshipped by the Malla kings, and is an important religious site.Taleju Bhawani is one of the most powerful goddess and her temple stands out among the many temples and monuments around Durbar Square. Legend has it that she played Tripasa (a dice game) with the last Malla king Jayaprakash Malla every night."
                    ]
                },
                {
                    "intent": "ask_about_identity_and_heritage",
                    "examples": [
                        "How does Bhaktapur Durbar Square contribute to Nepal's identity?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square contributes to Nepal's identity by preserving its rich cultural heritage, architecture, and religious significance."
                    ]
                },
                {
                    "intent": "ask_about_local_artisans_contribution",
                    "examples": [
                        "How do local artisans contribute to Bhaktapur Durbar Square?",
                        "local art", "art", "souvenirs"
                    ],
                    "responses": [
                        "Local artisans contribute by practicing traditional crafts such as wood carving, pottery, and metalwork, which help maintain the cultural heritage of Bhaktapur."
                    ]
                },
                {
                    "intent": "ask_about_economy_through_tourism",
                    "examples": [
                        "How does Bhaktapur Durbar Square support the local economy?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square supports the local economy by attracting tourists who contribute to the economy through entrance fees, local crafts, and guided tours."
                    ]
                },
                {
                    "intent": "ask_about_cultural_exchange",
                    "examples": [
                        "How does Bhaktapur Durbar Square promote cultural exchange?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square promotes cultural exchange through its festivals, events, and educational programs that showcase Nepal's rich cultural heritage."
                    ]
                },
                {
                    "intent": "bhaktapur.photo",
                    "examples": [
                      "Is photography allowed at durbar square?",
                      "Is photography allowed?", "photo", "photographs", "photography",
                      "can i take pictures?"
                    ],
                    "responses": [
                        "Photography is allowed, but there is an entry fee for tourists, which helps with the preservation of the area. Strict photography restrictions apply to some temples and religious sites.As with the other Durbar Squares, commercial photography requires a permit."
                    ]
                }

            ]
        },
        {
            "intent": "kathmandu_durbar_square",
            "examples": [
                "What is Kathmandu Durbar Square?",
                "Where is Kathmandu Durbar Square located?",
                "Why is Kathmandu Durbar Square important?",
                "kathmandu durvar square",
                "ktm durbar square", "kathmandu durbar",
                "basantapur"
            ],
            "responses": [
                "Kathmandu Durbar Square (Basantapur) is a historic site in the heart of Kathmandu, known for its palaces, temples, and courtyards. It is located in central Kathmandu, near the Thamel area. It was the royal palace of the Malla kings and later the Shah dynasty, serving as the center of administration and culture."
            ],
            "follow_up_questions": [
                {"intent": "more",
            "examples": ["more", "more about basantapur", "tell me more", "what else"
            ],
        "responses": [ "TALEJU TEMPLE: The Taleju Temple is the tallest of all structures, built by King Mahendra Malla in 1549 AD. This temple is open to the public for one day each year during the Dashain festival.\n KUMARI TEMPLE: The 17th century Kumari Temple, or the temple of Living Goddess is an example of highly developed Nepali craftsmanship. This is the official residence of Living Goddess Kumari of Kathmandu. Visitors can get a peek of the living goddess and seek blessings during special hours.\n JAGANNATH TEMPLE: Built in the 16th century, the Jagannath Temple is known for the fascinating erotic figures carved on the wooden struts.\n NASAL CHOWK:  This lovely courtyard inside the main entrance will be your first experience of the historic royal residence. Nasal Chowk was built during the Malla dynasty, although many of the structures in the area were built during the Rana period. Nasal Chowk was utilized for coronations throughout the Rana regime, and the practice persisted until 2001.\n NARSINGHA STATUE: Narsingha is thought to be Lord Vishnu in his man-lion avatar, disemboweling a demon. Pratap Malla erected the stone image in 1673, and according to the inscription on the monument, he did so out of fear of upsetting Vishnu by dancing in a Narsingha attire.\n SWET BHAIRAV: Swet Bhairav is a statue of Bhairav, avatar of Shiva. This Bhairav temple is open to the public once in year during the festival of Indra Jatra during August-September.\n SHISHA BAITHAK: Shisha Baithak is an open patio with the Malla throne on display, and pictures of the Shah kings.\n TRIBHUWAN MUSEUM: Along with memorials to Kings Mahendra and Birendra, the Tribhuwan Museum commemorates King Tribhuvan and his successful insurrection against their regime. The museum exhibits the  king's bedroom and study, complete with real personal belongings that provide a surreal look into his existence. The king's boxing gloves, the walking staff with a spring-loaded sword hidden inside, and his dusty, empty aquarium provide some mysterious moments. There are several spectacular thrones, numerous hunting photographs, and the typical coin collection on display.\n KAL BHAIRAB: The Kal Bhairav is one of the largest 17th century stone statues in Kathmandu, representing the terrifying aspect of Lord Shiva." ]
        },
                {
                    "intent": "historical_and_cultural_significance",
                    "examples": [
                        "What is the historical significance of Kathmandu Durbar Square?",
                        "Which festivals are celebrated at Kathmandu Durbar Square?",
                        "What are some of the key landmarks in Kathmandu Durbar Square, and their founding dates?",
                        "What is known about the establishment of Kathmandu Durbar Square?",
                        "history and culture", "history", "culture"
                    ],
                    "responses": [
                        "It was the royal palace of the Malla kings and later the Shah dynasty, serving as the center of administration and culture. Major festivals include Indra Jatra, Dashain, and Kumari Jatra. The First Royal Palace: 11th century by Shankaradev\nKasthamandap Temple: 12th century by Laxmi Nar Singh Malla, renovated in the 16th century\nTaleju Temple: 1564 by Ratna Malla\nHanuman Dhoka Palace: 17th century, constructed by multiple kings of the Lichhavi and Shah dynasties\nNautale Durbar (Basantapur Durbar): 1770 by Prithvi Narayan Shah\nKumari Ghar: 1757 by Jaya Prakash Malla."
                    ]
                },
                {
                    "intent": "living.goddess",
                    "examples": [
                        "can i see living goddess?",
                        "living goddess",
                        "Is photography allowed?", "goddess kumari", "kumari"
                    ],
                    "responses": [
                        "Yes, you may see Kumari at Kumari Ghar’s window during certain hours, but photography is not allowed inside."
                    ]
                },
                {
                    "intent": "who.is.living.goddess",
                    "examples": [
                       "who is living goddess?",
                       "how is living goddess chosen?",
                       "living goddess kumari of nepal", "kumari ghar"
                    ],
                    "responses": [
                        "Kumari ghar is the residence of the living Goddess. The Kumari, or Living Goddess, is a prepubescent girl worshipped as the physical embodiment of the Hindu goddess Taleju (Durga) in Nepal.The Kumari tradition is a centuries-old practice in Nepal where a young girl is chosen to be the human manifestation of the goddess Taleju, worshipped by both Hindus and Buddhists. She is chosen from the Newar Buddhist community and remains a deity until she reaches puberty. The most famous Kumari resides in Kathmandu Durbar Square, but there are also Kumaris in Patan and Bhaktapur."
                    ]
                },
                {
                    "intent": "architecture",
                    "examples": [
                        "What are the main architectural highlights of Kathmandu Durbar Square?",
                        "Can you tell me about the Hanuman Dhoka Palace?",
                        "What is the significance of the Kal Bhairav statue?", "architecture", "hanuman dhoka"
                    ],
                    "responses": [
                        "Key architectural highlights include the Hanuman Dhoka Palace, Taleju Temple, and the statue of Kal Bhairav.The Hanuman Dhoka Palace is an ancient palace complex that served as the royal residence and administrative center.The Taleju Temple is a three-story temple dedicated to the goddess Taleju, built in 1564.The statue of Kal Bhairav is a massive stone image of the fearsome aspect of Lord Shiva, believed to be a protector."
                    ]
                },
                {
                    "intent": "openinghours_entryfee",
                    "examples": [
                        "What are the opening hours of Kathmandu Durbar Square?",
                        "opening hours",
                        "How much is the entry fee for Kathmandu Durbar Square?",
                        "entry fee", "opening time",
                        "Is Kathmandu Durbar Square accessible for disabled visitors?", "opening hours and entry fee", "visiting hours"
                    ],
                    "responses": [
                        "The square is open from early morning until evening, though specific timings can vary Entry fees vary for locals and foreigners, with discounts for SAARC nationals.The square has some areas that are accessible for disabled visitors, but certain historical structures may have limited accessibility."
                    ]
                },
                {
                    "intent": "ktm.attractions",
                    "examples": [
                        "major attraction", "major attractions",
                        "attractions", "attraction", "tourist activities",
                        "tourist attractions", "what to visit", "where to visit", 
                        "places to visit", "sites to visit",
                        "faqs"
 
                    ],
                    "responses": [
                       " Hanuman Dhoka Palace – A historic palace with intricate architecture and a museum showcasing Nepalese history. \n  Kumari Ghar (Kumari Palace) – The residence of the living goddess Kumari, where you might get a glimpse of her. \n Taleju Temple – A magnificent 16th-century temple dedicated to Goddess Taleju, standing tall within the square.\n Jagannath Temple – Known for its erotic carvings and beautiful wooden architecture.\n Shiva-Parvati Temple – A temple with statues of Lord Shiva and Parvati peering from the windows.\n Kasthamandap – The legendary wooden pavilion that gave Kathmandu its name, originally built from a single tree.\n Freak Street (Jhochhen Tole) – A historic street famous for its hippie culture in the 1960s and 70s."
                    ]
                },
                {
                    "intent": "trivia_and_fun_facts",
                    "examples": [
                        "What is a fun fact about Kathmandu Durbar Square?",
                        "Are there any legends associated with Kathmandu Durbar Square?",
                        "What are some lesser-known facts about Kathmandu Durbar Square?",
                        "What unique traditions are associated with Kathmandu Durbar Square?", "funfact"
                    ],
                    "responses": [
                        "The square has a unique tradition of the living goddess Kumari, who is chosen from the Newar community and worshipped until she reaches puberty.One popular legend is about the construction of the Kasthamandap temple, believed to be built from the wood of a single tree.The square was the site of the coronation of many kings of Nepal, including King Birendra and King Gyanendra.During Indra Jatra, the living goddess Kumari is taken around the city in a chariot procession, attracting large crowds of devotees."
                    ]
                },
                {
                    "intent": "tips_for_visitors",
                    "examples": [
                        "What safety tips should visitors keep in mind?",
                        "What cultural etiquette should visitors follow?", "tips",
                        "What type of footwear is recommended for visiting Kathmandu Durbar Square?",
                        "How should visitors respect the local culture at Kathmandu Durbar Square?"
                    ],
                    "responses": [
                        "Visitors should be mindful of their belongings, especially during crowded festivals.Visitors should respect local customs and traditions, and dress modestly when visiting temples. Wear comfortable shoes, as the square is a large area with many landmarks and attractions to explore, ensuring you can walk around comfortably. Visitors should dress modestly, remove their shoes before entering temples or other religious sites, and behave respectfully towards others."
                    ]
                },
                {
                    "intent": "photography",
                    "examples": [
                        "Is photography allowed?",
                        "Is photography allowed at durbar square?",
                        "photo", "photographs", "photography",
                        "can i take pictures?", "pictures", 
                        "can i take pictures inside kathmandu durbar square?"
                    ],
                    "responses": [
                       "Photography is generally allowed, but there are some restrictions. No photography is allowed inside the Kumari Ghar (Living Goddess' residence), where visitors are asked not to take photos out of respect for the tradition. Professional photography (e.g., for commercial purposes) typically requires a special permit."
                    ]
                },
                {
                    "intent": "how_to_reach_kathmandu_durbar_square",
                    "examples": [
                        "How accessible is Kathmandu Durbar Square from various parts of the city?",
                        "Can you walk to Kathmandu Durbar Square from Thamel?",
                        "How can you reach Kathmandu Durbar Square ?",
                        "What public transportation options are available to reach Kathmandu Durbar Square?",
                        "Is it possible to reach Kathmandu Durbar Square by bicycle?"
                    ],
                    "responses": [
                        "The square is easily accessible from many parts of the city and can be reached by various transportation options.",
                        "Yes, if you are staying in the Thamel area, you can easily walk to the square. It is within walking distance (10-20 minutes) from many popular tourist areas, such as Thamel, Asan Tole, and New Road.",
                        "You can hire a car or taxi from your hotel, guesthouse, or one of the many car rental agencies in the city. Vehicles are not allowed inside the square area, so you'll be dropped at one of the many entrances.",
                        "Public transportation is readily available in the city and is a cheap and convenient way to get around. Several bus stops and pickup points are located near the square, such as RNAC, Ratnapark, Lainchaur, and Sahid Gate. You can take a bus or microbus to get there.",
                        "Yes, you can rent a bike or bring your own and ride to the square. Unlike vehicles, bicycles are allowed inside the square. You can also join a guided bike tour to visit the square and other popular attractions in the city."
                    ]
                }, 
                 {
                    "intent": "tips_for_visitors",
                    "examples": [
                        "What safety tips should visitors keep in mind?",
                        "What cultural etiquette should visitors follow?", "tips",
                        "What type of footwear is recommended for visiting Kathmandu Durbar Square?",
                        "How should visitors respect the local culture at Kathmandu Durbar Square?"
                    ],
                    "responses": [
                        "Visitors should be mindful of their belongings, especially during crowded festivals.Visitors should respect local customs and traditions, and dress modestly when visiting temples. Wear comfortable shoes, as the square is a large area with many landmarks and attractions to explore, ensuring you can walk around comfortably. Visitors should dress modestly, remove their shoes before entering temples or other religious sites, and behave respectfully towards others."
                    ]
                },

                {
                    "intent": "hanuman_dhoka",
                    "examples": [
                      "hanuman dhoka"
                    ],
                    "responses": [
                        "Hanuman Dhoka is a historical palace complex located in the heart of Kathmandu, near Basantapur Durbar Square. It was once the royal palace for the Malla kings and later the Shah kings of Nepal. \n Historical Significance: 1. Royal Palace: Hanuman Dhoka was the residence of Nepal's royal family for several centuries. The name Hanuman Dhoka comes from the Hanuman statue at the entrance, which is believed to have been built to protect the royal family. \n 2. King Prithvi Narayan Shah: Hanuman Dhoka is historically significant as the place where King Prithvi Narayan Shah declared the unification of Nepal in the 18th century. \n 3. Hanuman Statue: A large statue of Lord Hanuman stands at the entrance, which is a major attraction. \n 4. Nasal Chowk: A beautiful courtyard within the palace where the kings held ceremonies."
                    ]
                }
            ]
        },
        {
            "intent": "about_pashupatinath",
            "examples": [
                "Tell me about Pashupatinath",
                "What is Pashupatinath?",
                "Give me some information about Pashupatinath",
                " Pashupatinath", "pashupatinath temple",
                "pashupati", "pashpati"
            ],
            "responses": [
                "The Pashupatinath Temple (Nepali: पशुपतिनाथ मन्दिर) is a Hindu temple dedicated to Pashupati, a form of Shiva. It is located in Kathmandu, Nepal, on the bank of the Bagmati River. The temple was classified as a World Heritage Site in 1979. This 'extensive Hindu temple precinct' is a 'sprawling collection of temples, ashrams, images and inscriptions raised over the centuries along the banks of the sacred Bagmati river', and is one of seven monument groups in UNESCO's designation of Kathmandu Valley."
            ],
            "follow_up_questions": [
                {
                    "intent": "ask_about_location",
                    "examples": [
                        "Where is Pashupatinath located?",
                        "Can you tell me the location of Pashupatinath?",
                        "location"
                    ],
                    "responses": [
                        "Pashupatinath Temple is located in Kathmandu, Nepal, on the banks of the Bagmati River. Address: Pashupati Nath Road, Kathmandu 44600. Go to maps for better location"
                    ]
                },
                {
                    "intent": "more",

                 "examples":["more", 
                 "more about pashupatinath"],

                 "responses": ["Pashupatinath Temple, located on the banks of the Bagmati River in Kathmandu, Nepal, is one of the holiest Hindu temples dedicated to Lord Shiva. It is a UNESCO World Heritage Site and an important pilgrimage destination for Hindus worldwide. The temple complex, known for its pagoda-style architecture and sacred atmosphere, is considered a major spiritual center. The inner temple houses a sacred lingam (symbol of Lord Shiva), and only Hindus are permitted to enter it. Non-Hindus can still enjoy the temple’s beauty and observe the rituals from across the river. \n The temple complex is open daily from 4:00 AM to 9:00 PM, with the inner temple being accessible in the morning (5:00 AM to 12:00 PM) and evening (5:00 PM to 7:00 PM). Foreign nationals are required to pay an entrance fee of NPR 1,000, while Indian and Nepalese nationals can enter for free.\n The temple is also famous for its cremation ghats along the Bagmati River, where Hindu funeral rites are performed. Pashupatinath is not only a religious site but also a place of cultural significance, attracting visitors for both its spiritual importance and the tranquil beauty of the surrounding area."]
                      },
                {
                    "intent": "ask_about_deity",
                    "examples": [
                        "Which deity is worshipped at Pashupatinath?",
                        "Who is the main deity of Pashupatinath?",
                        "main deity", "what god", "what god is worshipped",
                        "main god","worship",
                        "which god"
                    ],
                    "responses": [
                        "Pashupatinath Temple is dedicated to Lord Shiva, one of the principal deities in Hinduism.The sacro sanctum, or the main idol, is a stone Mukhalinga with a silver yoni base bound with a silver serpent. It is one metre high and has faces in four directions, which represent various aspects of Shiva; Sadyojata (also known as Barun), Vamadeva (also known as Ardhanareshwara), Tatpurusha, Aghora, and Ishana (imaginative). Each face has tiny protruding hands holding rudraksha mala in the right hand and a kamandalu in the other. Unlike other Shiva lingams in India and Nepal, this lingam is always dressed in its golden vastram except during abhisheka, so pouring milk and Ganga Jal is only possible during the ritual through the main priests."
                    ]
                },
                {
                    "intent": "ask_about_architecture",
                    "examples": [
                        "What is the architecture of Pashupatinath?",
                        "Can you describe the architecture of Pashupatinath?",
                        " Pashupatinath architecture",
                        "architecture"
                    ],
                    "responses": [
                        "This main temple is built in Newari architecture. The two-level roofs are of copper with gold covering. The temple rests on a square base platform with a height of 23m 7 cm from base to pinnacle. It has four main doors, all covered with silver sheets. This temple has a gold pinnacle (peak). Inside are two garbhagrihas: the inner garbhagriha or sanctum sanctorum is where the idol is placed, and the outer sanctum is an open corridor-like space."
                    ]
                },
                {
                    "intent": "entry_fee_opening_hours",
                    "examples": [
                     "opening hours and entry fee", 
                     "opening hours", "visiting hours",
                      "entry fees", "opening time",
                       "when does it open?",
                        "entry fee"
                    ],
                    "responses": [
                        "Opening Hours: Temple Complex: Open daily from 4:00 AM to 9:00 PM. \n Inner Temple: Morning: 5:00 AM to 12:00 PM \n Evening: 5:00 PM to 7:00 PM \n Note: The inner temple may close between 12:00 PM and 5:00 PM. \n  Entry Fees: \n Foreign Nationals: An entrance fee of 1,000 Nepalese Rupees (NPR) is required to access the temple complex. \n Indian and Nepalese Nationals: Free entry; however, only Hindus are permitted inside the main temple premises. "
                    ]
                },
                {
                    "intent": "ask_about_festivals",
                    "examples": [
                        "What festivals are celebrated at Pashupatinath?",
                        "Which is the main festival at Pashupatinath?",
                        "festivals"
                    ],
                    "responses": [
                        "The main festival celebrated at Pashupatinath is Maha Shivaratri, which attracts thousands of devotees. Teej is also one of the most celebrated festivals in Nepal. Teej is celebrated in Pashupatinath temple and the shiva's temple. In this festival, most of the girls and women celebrate by singing and dancing on a song that is dedicated to shiva."
                    ]
                },
                {
                    "intent": "ask_about_rules",
                    "examples": [
                        "Who can enter the inner sanctum of Pashupatinath?",
                        "Are non-Hindus allowed inside Pashupatinath?",
                        "hindus in pashupatinath", "rules",
                        "muslims", "can a tourist go?",
                        "christains",
                        "religions"
                    ],
                    "responses": [
                        "Only Hindus are allowed inside the inner sanctum of Pashupatinath Temple. Non-Hindus can view the temple from the outside."
                    ]
                },
                {
                    "intent": "ask_about_history",
                    "examples": [
                        "What is the history of Pashupatinath?",
                        "When was Pashupatinath built?"
                    ],
                    "responses": [
                        "Pashupatinath Temple dates back to the 5th century and is one of the oldest Hindu temples in Nepal. It was designated a UNESCO World Heritage Site in 1979.Pashupatinath Temple is the oldest Hindu temple in Kathmandu. The temple is considered to be pre-Vedic in its origin and according to Nepal Mahatmaya and Himvatkhanda of Skanda Purana, the deity here gained great fame as Pashupati. As per Shiva Purana, the linga of Pashupatinath that lies in Nepal has the capacity to fulfill all desires, and the story of Pashupatinath is narrated along with the greatness of Kedareshwara (Kedarnath) in the 9th chapter of 'Koti-Rudra Samhita' which describes the journey of Pandavas in the search of Shiva. After Pandavas perform much penance, Shiva who had hidden himself underground in the form of a bull, reappears with his head in Pashupatinath, hump in Kedarnath, face in Rudranath, arms in Tungnath and navel in Madhyamaheshwar. One legend says that Shiva and Parvati took the form of antelopes in the forest on the Bagmati river's east bank. The gods later caught up with him and grabbed him by one of his horns, forcing him to resume his divine form. The broken horn was worshipped as a linga, but over time it was buried and lost. Centuries later a herdsman found one of his cows showering the earth with milk, and after digging at the site, he discovered the divine linga of Pashupatinath. Pashupatinath Temple's existence is recorded as early as 400 CE. The ornamented pagoda houses the linga of Shiva. According to Gopalraj Aalok Vhat, the temple was built by Prachanda Deva, a Licchavi king. Another chronicle states that Pashupatinath Temple was in the form of Linga shaped Devalaya before Supuspa Deva constructed a five-storey temple of Pashupatinath in this place. As time passed, the temple needed to be repaired and renovated. It is known that this temple was reconstructed by a medieval king named Shivadeva (1099–1126 CE). It was renovated by Ananta Malla adding a roof to it. Further temples have been erected around the two-storied temple, including the Vaishnava temple complex with a Rama temple from the 14th century and the Guhyeshwari Temple mentioned in an 11th-century manuscript, overtime. The current form of the temple was renovated in 1692 CE after the previous structures were affected by termites and earthquakes."
                    ]
                },
                {
                    "intent": "ask_about_rituals",
                    "examples": [
                        "What rituals are performed at Pashupatinath?",
                        "What is the Bhasm Aarti at Pashupatinath?",
                        "aarati", "culture",
                        "rituals"
                    ],
                    "responses": [
                        "Daily rituals at Pashupatinath include morning and evening prayers, abhishekam (ritual bath), and the Bhasm Aarti, a special fire ritual performed at dawn and dusk."
                    ]
                },
                {
                    "intent": "ask_about_significance",
                    "examples": [
                        "Why is Pashupatinath important?",
                        "What is the significance of Pashupatinath?",
                        "significance"
                    ],
                    "responses": [
                        "Pashupatinath is one of the holiest Shiva temples in the world and a UNESCO World Heritage Site. It is a major pilgrimage site for Hindus, especially during Maha Shivaratri."
                    ]
                },
                {
                    "intent": "pashupati.attractions",
                    "examples": [
                       "major attraction", "major attractions", "tourist activities",
                       "tourist site", "tourist attractions", "everything i need to know about pashupatinath"
                    ],
                    "responses": [
                        "Pashupatinath Temple is one of the holiest Hindu temples in Nepal and a UNESCO World Heritage Site. It attracts thousands of visitors each year, both for its spiritual significance and architectural beauty.\n  Here are the major attractions at Pashupatinath Temple: 1. Pashupatinath Temple Significance: The main temple, dedicated to Lord Shiva, is the most important part of the complex. It is the most revered pilgrimage site for Hindus and is believed to be one of the 12 Jyotirlingas (sacred shrines of Shiva) in the world. \n Golden Roof and Architecture: The temple is known for its golden roof and intricate pagoda-style architecture, with beautiful wooden carvings and detailed designs.\n 2. Bhasmeshwor (Cremation Ghats) Cremation Rituals: The Bhasmeshwor Ghat along the Bagmati River is a place where Hindus perform cremation rituals. Visitors can observe the traditional funeral process, which is an integral part of Hindu culture. \n Spiritual Significance: The ghats are considered highly sacred, and it is believed that those who are cremated here attain moksha (liberation from the cycle of rebirth).\n 3. Sadhus (Holy Men)Presence of Sadhus: You’ll encounter Sadhus—holy men dressed in vibrant colors, who are followers of Lord Shiva. They often perform rituals, meditate, and can be seen around the temple.\n Spiritual Experience: It’s common for visitors to interact with these Sadhus, take photographs, and seek blessings.\n 4. Kailashnath Mahadev Statue. Size and Significance: The Kailashnath Mahadev Statue, located nearby (in Sanga, just outside the temple complex), is one of the tallest statues of Lord Shiva in the world. It's an impressive modern-day attraction and a must-see for visitors to Pashupatinath.\n 5.Pagoda-style Architecture and Temples \n Various Temples: The Pashupatinath temple complex consists of several smaller temples dedicated to different gods and goddesses, such as Madhyameshwar, Guhyeshwari, and Bhairab. \n Architecture: The temples feature classic Newar architecture with pagoda-style roofs and intricately carved wooden windows and doors.\n 6. The Bagmati River \n Spiritual Importance: The Bagmati River, flowing next to the temple complex, is considered holy. Many devotees come to bathe in the river for purification and spiritual cleansing. \n Rituals on the Banks: Along the riverbanks, you can witness a variety of religious rituals, including offerings and prayers. \n 7. The Ashram of the Shiva Lingam. \n Sacred Site: The Shiva Lingam is an abstract representation of Lord Shiva, and the ashram dedicated to it is considered highly sacred by devotees. The worship of this deity is an important part of the temple experience."
                    ]
                }

            ]
        },
        {
            "intent": "about_boudhanath",
            "examples": [
                "Tell me about Boudhanath",
                "What is Boudhanath?",
                "Boudhanath",
                "boudha",
                "bouddha"
            ],
            "responses": [
                "Boudhanath Stupa is one of the largest stupas in the world and a UNESCO World Heritage Site. It is a significant pilgrimage site for Tibetan Buddhists.It is a stupa and major spiritual landmark seen as the embodiment of the enlightened mind of all the Buddhas [who follow the Buddhism religion]."
            ],
            "follow_up_questions": [
                {"intent":"more",
            "examples":[
                "more", "more about bouddha"
            ],
        "responses":[
            "Bouddhanath Stupa, located in the eastern part of Kathmandu, Nepal, is one of the largest and most important Buddhist stupas in the world. Revered as a sacred site by Tibetan Buddhists, it is a focal point for both religious pilgrimage and cultural heritage. The stupa, with its large mandala and all-seeing eyes of Buddha painted on the tower, symbolizes the all-pervading awareness of the Buddha. \n Surrounded by a bustling area filled with monasteries, Tibetan shops, and cafes, Bouddhanath is a hub for Tibetan culture in Nepal. Visitors often walk around the stupa (kora), spinning prayer wheels and chanting mantras, as a form of devotion. The stupa is particularly important during festivals like Buddha Jayanti, when pilgrims and tourists gather for prayers, rituals, and celebrations.\n The area is also home to several Tibetan monasteries and gompas (temples), where monks lead prayers and meditation. Tibetan handicrafts, such as thangkas (traditional paintings), prayer flags, and jewelry, are sold in the local markets, adding to the rich cultural experience. Bouddhanath is an ideal place for those seeking spiritual reflection, meditation, and an immersion in Tibetan Buddhist culture, making it a must-visit for tourists interested in history, spirituality, and tradition."
        ]},
                {
                    "intent": "ask_about_location",
                    "examples": [
                        "Where is Boudhanath located?",
                        "Can you tell me the location of Boudhanath?",
                        "boudha location",
                        "location"
                    ],
                    "responses": [
                        "Boudhanath Stupa is locate in Boudhanath, within the city of Kathmandu, Nepal. Built in the northeast of Kathmandu Valley in a Tamang village surrounded by rice paddies,the stupa gave birth to the origins of Tibetan Buddhism."
                    ]
                },
                {
                    "intent": "ask_about_history",
                    "examples": [
                        "What is the history of Boudhanath?",
                        "When was Boudhanath built?",
                        "history"
                    ],
                    "responses": [
                        "Boudhanath Stupa dates back to the 14th century and is believed to have been built to enshrine the relics of the Buddha.An earlier written source Gopālarājavaṃśāvalī says Boudhanath itself was founded by the Nepalese Licchavi king Śivadeva (c. 590–604 CE); though other Nepalese chronicles date it to the reign of King Mānadeva (464–505 CE). The earliest historical references to the Khaasti Chaitya are found in the Chronicles of the Newars. First, Khaasti is mentioned as one of the four stupas found by the Licchavi king Vrisadeva (c. 400 CE) or Vikramjit. Second, the Newars legend of the stupa's origin attributes it to King Dharmadeva's son, Manadeva as atonement for his unwitting patricide. Manadeva was a great Licchavi king, military conqueror and a patron of the arts who reigned c. 464–505. Manadeva is also linked with the Swayambhu Chaitya of Gum Bahal. Third, another great Licchhavi king Shivadeva (AD 590–604) is associated with Boudha by an inscription; he may have restored the chaitya."
                    ]
                },
                {
                    "intent": "ask_about_architecture",
                    "examples": [
                        "What is the architecture of Boudhanath?",
                        "Can you describe the architecture of Boudhanath?",
                        "boudha architecture",
                        "architecture"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a massive mandala, designed to represent the universe. Its main feature is the all-seeing eyes of the Buddha.Mandala Shape: Standing tall and dominating the horizon, the Boudhanath Stupa is indeed one of the largest stupas in the world and the biggest in Nepal. Its magnificent structure is a visual representation of Lord Buddha’s path to enlightenment. The Stupa is designed in the shape of a mandala, which is a sacred geometric pattern that represents the universe and the interconnectedness of all things. The mandala shape of the Boudhanath stupa is intended to symbolize the totality of existence and the journey toward enlightenment. With each part symbolizing an essential element of Buddhism, Boudhanath Stupa is undoubtedly a magnificent site of peace and serenity. \n Base and Spires of the Stupa : At the base of the stupa, the Earth is represented. The Kumbha or white dome represents water, while the spire represents air, and the top umbrella form symbolizes the void. According to Buddhist belief, 13 phases are needed to attain Nirvana, and the 13 spires of the stupa represent these stages. Walking clockwise around the stupa, while keeping it to your right, is customary. Prayer wheels should also be spun in a clockwise direction. \n The Eyes of Buddha: The stupa's name is derived from the thirteen steps, which symbolize the Bodhisattva's basis for enlightenment or 'Bodhi' in its thirteen phases. The triangle at the top of the stupa represents fire. The four corners of the stupa’s central tower are adorned with massive pairs of eyes, which represent the Buddha's eyes of wisdom. The eyes of the stupa stand in for the Buddha's all-seeing ability. The nose of the stupa represents Nirvana and is also supposed to reflect the Nepali letter representing the number one, which stands for unity and the only path to enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_religion",
                    "examples": [
                        "Why is Boudhanath important in Buddhism?",
                        "What is the religious significance of Boudhanath?",
                        "religion",
                        "buddhism",
                        "buddhas",
                        "buddhist"
                    ],
                    "responses": [
                        "Boudhanath Stupa is one of the holiest Buddhist sites in Nepal. It is a center of Tibetan Buddhism and attracts pilgrims from all over the world. \n  Buddhism, founded by Siddhartha Gautama 'the Buddha' in the 6th century BCE, is a spiritual tradition centered around understanding and overcoming suffering. It teaches that suffering is an inherent part of life, caused by desire and attachment. \n The Buddha's teachings are encapsulated in the Four Noble Truths: (1) suffering exists, (2) it has a cause, (3) it can be ended, and (4) there is a path to its cessation, known as the Noble Eightfold Path. \n The Eightfold Path consists of ethical and mental practices, including right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration, all aiming to end suffering and achieve Nirvana, a state of liberation from the cycle of birth and rebirth (samsara). \n Buddhism emphasizes mindfulness, meditation, and ethical living. It teaches non-attachment, non-self (anatta), and impermanence (anicca). Major branches of Buddhism include Theravada, Mahayana, and Vajrayana, each with unique practices and interpretations of Buddhist teachings. Buddhism has greatly influenced the culture, art, and philosophy of many Asian countries and continues to offer practical guidance for reducing suffering and achieving peace."
                    ]
                },
                
                {
                    "intent": "ask_about_unesco_status",
                    "examples": [
                        "Is Boudhanath a UNESCO World Heritage Site?",
                        "When was Boudhanath designated as a UNESCO site?"
                    ],
                    "responses": [
                        "Yes, Boudhanath Stupa was designated a UNESCO World Heritage Site in 1979 due to its cultural and religious significance."
                    ]
                },
                {
                    "intent": "ask_about_pilgrimage",
                    "examples": [
                        "Why do people visit Boudhanath?",
                        "Is Boudhanath a pilgrimage site?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is an important pilgrimage site for Tibetan Buddhists. Devotees come to pray, make offerings, and perform circumambulations around the stupa."
                    ]
                },
                {
                    "intent": "bouddha.major.attraction",
                    "examples": [
                        "What can I do at Boudhanath?", "tourist site",
                        "What activities are available for tourists at Boudhanath?",
                        "tourist activities", "major attraction", "major attractions", "tourist attractions"
                    ],
                    "responses": [
                        "Visitors can walk around the stupa, participate in circumambulation, observe rituals, visit nearby monasteries, and shop for Tibetan handicrafts."
                    ]
                },
                {
                    "intent": "ask_about_opening_hours",
                    "examples": [
                        "What are the opening hours of Boudhanath?",
                        "When is Boudhanath open?",
                        "opening hours", "visiting hours", 
                        "opening time"
                    ],
                    "responses": [
                        "Boudhanath Stupa is open every day, typically from 6:00 AM to 7:00 PM."
                    ]
                },
                {
                    "intent": "ask_about_entry_fee",
                    "examples": [
                        "Is there an entry fee for Boudhanath?",
                        "How much is the entry fee for Boudhanath?",
                        "entry fee", "entry fees"
                    ],
                    "responses": [
                        "Yes, the entry fee for foreign nationals is NPR 400, while Nepali citizens can visit for free."
                    ]
                },
                {
                    "intent": "ask_about_surrounding_area",
                    "examples": [
                        "What is there to see around Boudhanath?",
                        "What are the attractions near Boudhanath?"
                    ],
                    "responses": [
                        "There are many monasteries, stupas, and Tibetan shops around Boudhanath Stupa. Visitors can also explore nearby Buddhist temples and local markets."
                    ]
                },
                {
                    "intent": "ask_about_monasteries",
                    "examples": [
                        "What are the famous monasteries near Boudhanath?", "monastry",
                        "Can you tell me about the monasteries near Boudhanath?", "monastries"
                    ],
                    "responses": [
                        "Some of the well-known monasteries near Boudhanath include the Shechen Monastery, the Kagyu Monastery, and the Tibetan Buddhist Monastery."
                    ]
                },
                {
                    "intent": "ask_about_cultural_significance",
                    "examples": [
                        "What is the cultural significance of Boudhanath?",
                        "Why is Boudhanath culturally important?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a cultural hub for Tibetan Buddhism. It serves as a center for cultural exchange, religious practices, and Tibetan identity in Nepal."
                    ]
                },
                {
                    "intent": "ask_about_special_events",
                    "examples": [
                        "What festivals are celebrated at Boudhanath?",
                        "Are there any special events at Boudhanath?", "festivals"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a focal point for Tibetan Buddhist festivals, including Losar (Tibetan New Year), Buddha Jayanti, and the Monlam Prayer Festival."
                    ]
                },
                {
                    "intent": "ask_about_tibetans",
                    "examples": [
                        "Why are there so many Tibetans at Boudhanath?",
                        "What role do Tibetans play at Boudhanath?", "tibetians"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a prominent site for Tibetans in Nepal. It has a strong Tibetan community and is a spiritual and cultural hub for Tibetan refugees in Nepal."
                    ]
                },
                {
                    "intent": "ask_about_famous_items",
                    "examples": [
                        "What are the famous items sold near Boudhanath?",
                        "Can I buy Tibetan handicrafts at Boudhanath?",
                        "souvenirs",
                        "what to buy?"
                    ],
                    "responses": [
                        "Popular items include prayer wheels, thangka paintings, Tibetan jewelry, prayer flags, and traditional Tibetan clothing."
                    ]
                },
                {
                    "intent": "ask_about_transportation",
                    "examples": [
                        "How can I get to Boudhanath?",
                        "What is the best way to reach Boudhanath?", "how to reach?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is easily accessible by taxi, rickshaw, or public transportation. It's about a 15-minute drive from the center of Kathmandu."
                    ]
                },
                {
                    "intent": "ask_about_best_time_to_visit",
                    "examples": [
                        "When is the best time to visit Boudhanath?",
                        "What is the best time of day to visit Boudhanath?",
                        "when to visit?"
                    ],
                    "responses": [
                        "The best time to visit Boudhanath Stupa is early in the morning for a peaceful atmosphere or in the late afternoon when the sunset offers a beautiful view."
                    ]
                },
                {
                    "intent": "ask_about_circumambulation",
                    "examples": [
                        "What is circumambulation at Boudhanath?",
                        "Why do people walk around Boudhanath?",
                        "what direction?"
                    ],
                    "responses": [
                        "Circumambulation is a spiritual practice where pilgrims walk around the stupa in a clockwise direction, chanting mantras and making offerings for blessings."
                    ]
                },
                {
                    "intent": "ask_about_meditation",
                    "examples": [
                        "Can I meditate at Boudhanath?",
                        "Is Boudhanath a good place for meditation?",
                        "meditation"
                    ],
                    "responses": [
                        "Yes, Boudhanath Stupa is an excellent place for meditation. The serene environment and spiritual atmosphere make it ideal for quiet reflection and mindfulness."
                    ]
                },
                {
                    "intent": "ask_about_pilgrims",
                    "examples": [
                        "How many pilgrims visit Boudhanath annually?",
                        "Are there many pilgrims at Boudhanath?"
                    ],
                    "responses": [
                        "Boudhanath Stupa attracts thousands of pilgrims every year, particularly during major Buddhist festivals such as Losar and Buddha Jayanti."
                    ]
                },
                {
                    "intent": "ask_about_significance_in_buddhism",
                    "examples": [
                        "Why is Boudhanath so significant in Buddhism?",
                        "What makes Boudhanath important in Buddhism?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is one of the most important Buddhist sites in Nepal. It is believed to hold the relics of the Buddha and is a center of Tibetan Buddhist culture."
                    ]
                }
                ]
        },

        {
            "intent": "patan_durbar_square",
            "examples": [
                "What is Patan Durbar Square?",
                "Where is Patan Durbar Square located?",
                "Why is Patan Durbar Square important?",
                "Patan Durbar Square", "patan"
            ],
            "responses": [
                "Patan Durbar Square is a historic site in the heart of Patan, known for its temples, palaces, and courtyards."
            ],
            "follow_up_questions": [
                {
                    "intent": "more",
                    "examples":[ "more", "details", "more about patan"
                ],
                "responses": ["Patan Durbar Square (Nepali: पाटन दरवार) is situated at the centre of the city of Lalitpur in Nepal. It is one of the three Durbar Squares in the Kathmandu Valley, all of which are UNESCO World Heritage Sites. One of its attractions is the medieval royal palace where the Malla Kings of Lalitpur resided.The Durbar Square is a marvel of Newar architecture. The square floor is tiled with red bricks.[1] There are many temples and statues in the area. The main temples are aligned opposite the western face of the palace.[2] The entrance of the temples faces east, towards the palace. There is also a bell situated in the alignment beside the main temples.[3] The Square also holds old Newari residential houses. There are other temples and structures in and around Patan Durbar Square built by the Newa People. A center of both Hinduism and Buddhism, Patan Durbar Square has 136 (bahals) (courtyards) and 55 major temples."]
                },

                {
                    "intent": "historical_and_cultural_significance",
                    "examples": [
                        "history and culture",
                        "history", "culture",
                        "history of patan durbar square"
                    ],
                    "responses": [
                        "Patan Durbar Square's establishment dates back to the Malla period, with the development of the square continuing over several centuries.The history of Durbar Square is not clear. Although the Malla Kings of Lalitpur are credited with the establishment of the royal square, it is known that the site is an ancient crossroad. The Pradhanas, who settled around the site before the Mallas, have connections with the Durbar Square.Some chronicles hint that the Thakuri dynasty built a palace and made reforms to the locality, but there is little evidence of this. Scholars are certain that Patan was a prosperous city since ancient times. There is also a evidence that the Patan was founded during the 3rd Century BC by the Kirat dynasty and was later expanded in the sixth century.The Malla Kings made important changes to the square. Most of the current architecture is from the 1600s, constructed during the reign of King Siddhi Narsingh Malla and his son Srinivasa Sukriti. Some of the notable Malla Kings who improved the square include Purandarasimha,Sivasimha Malla and Yoganarendra Malla."
                    ]
                },
                {
                    "intent": "patan.location",
                    "examples":[ "location", "where is it located?", "Where is Patan Durbar Square located?"
                ],
                "responses":["Patan durbar square is situated at the heart of Lalitpur district preserving a huge collection of fine art and architecture carved and inscribed on woods and metals by our ancestors. This city is very famous for temples, shrines, statues, monuments, festivals, culture, etc. that reflects our ancestor’s crafting skills. Even now, if we walk the small alleys of Patan we can hear the tapping of tiny hammers as craftsmen work on various ornaments and idols. Lalitpur is the second largest town of Kathmandu valley and is separated by the Bagmati River from Kathmandu. It is around 5 km away from Kathmandu. One can reach Patan in around 30 mins from Thamel depending on the traffic."]
                },
                {
                    "intent": "food",
                    "examples": ["food", "local cuisine", "what to eat" ],
                    "responses":[ "Traditional Delicacies are Samay Baji : A ceremonial platter consisting of beaten rice (chiura), buffalo meat, boiled eggs, black soybeans, and pickled vegetables, served as an auspicious dish in Newari feasts. \n Bara : Savoury lentil pancakes, made from black gram batter, fried to perfection, and often topped with eggs or minced meat. \n Chatamari : A thin, crispy rice flour crepe, often referred to as (Newari pizza) topped with eggs, minced meat, and spices, offering a delightful blend of textures and flavours. \n Choila : Spiced and grilled buffalo meat, marinated with mustard oil, garlic, and chilli, offering a bold and smoky flavour.\n Sapu Mhicha : A unique Newari speciality made of buffalo leaf tripe stuffed with bone marrow, slow-cooked for a melt-in-the-mouth texture.\n Yomari : A festival-exclusive steamed rice dumpling filled with a mixture of jaggery and sesame seeds, enjoyed during Yomari Punhi."]
                },
                {
                    "intent": "architecture",
                    "examples": [
                        "What are the main architectural highlights of Patan Durbar Square?",
                        "Can you tell me about the Hiranya Varna Mahavihar?",
                        "What is the significance of the Mahabouddha Temple?",
                        "architecture"
                    ],
                    "responses": [
                        "Key architectural highlights include the Hiranya Varna Mahavihar (Golden Temple), Mahabouddha Temple, and the ancient palace complex.The Hiranya Varna Mahavihar is a Buddhist monastery known for its golden exterior and intricate carvings.The Mahabouddha Temple, also known as the 'Temple of a Thousand Buddhas,' is famous for its unique brickwork."
                    ]
                },
                {
                    "intent": "points_of_interest",
                    "examples": [
                        "What museums can be found in Patan Durbar Square?",
                        "Golden Temple?", "museums", "temple"
                    ],
                    "responses": [
                        "Patan Durbar Square houses the Patan Museum, which showcases Nepalese art, architecture, and culture.The Golden Temple is a significant Buddhist temple in Patan, known for its golden exterior and cultural importance."
                    ]
                },
                {
                    "intent": "faqs",
                    "examples": [
                        "How can I get to Patan Durbar Square?",
                        "What other attractions are near Patan Durbar Square?",
                        "Is Patan Durbar Square safe for tourists?",
                        "What is the best time to visit Patan Durbar Square?"
                    ],
                    "responses": [
                        "You can reach Patan Durbar Square by taxi, rickshaw, or on foot from central Kathmandu areas like Thamel.",
                        "Nearby attractions include Swayambhunath (Monkey Temple), Garden of Dreams, and Kathmandu Durbar Square.",
                        "Patan Durbar Square is generally safe for tourists, but it's always good to stay aware of your surroundings.",
                        "The best time to visit is during the autumn (September to November) and spring (March to May) seasons when the weather is pleasant."
                    ]
                },
                {
                    "intent": "trivia_and_fun_facts",
                    "examples": [
                        "What is a fun fact about Patan Durbar Square?",
                        "Are there any legends associated with Patan Durbar Square?",
                        "What are some lesser-known facts about Patan Durbar Square?",
                        "What unique traditions are associated with Patan Durbar Square?"
                    ],
                    "responses": [
                        "One unique tradition is the Kumari Jatra, where the living goddess Kumari is paraded around the square in a chariot.",
                        "The Golden Temple is built entirely of wood and has a golden exterior, making it one of the most beautiful structures in Patan.",
                        "Patan Durbar Square was the site of the coronation of many Malla kings.",
                        "The square is also known for its traditional Newar architecture and its stunning wooden carvings."
                    ]
                },
                {
                    "intent": "entry_fee_and_opening_hours",
                    "examples": [
                        "What is the entry fee for different visitors?",
                        "What are the opening hours?", "entry fee", "entry fees",
                        "opening hours", "opening hours and entry fee", "visiting hours",
                        "opening time"
                    ],
                    "responses": [
                        "Entry fees vary for foreigners, SAARC nationals, and locals. For SAARC nationals, the entry fee is NRs 150, and for foreigners, it is NRs 1000.The square is open from 7 AM to 7 PM."
                    ]
                },
                {
                    "intent": "tips_for_visitors",
                    "examples": [
                        "What safety tips should visitors keep in mind?", "tips",
                        "What cultural etiquette should visitors follow?",
                        "What type of footwear is recommended for visiting Patan Durbar Square?",
                        "How should visitors respect the local culture at Patan Durbar Square?"
                    ],
                    "responses": [
                        "Visitors should be mindful of their belongings, especially during crowded festivals.\n Respect local customs, dress modestly when visiting temples, and be aware of sacred spaces. \n Wear comfortable shoes as the area is large and includes many temples and courtyards to explore. \n Remove shoes when entering temples and behave respectfully toward local customs and traditions."
                    ]
                },
                {
                    "intent": "how_to_reach_patan_durbar_square",
                    "examples": [
                        "How accessible is Patan Durbar Square from various parts of the city?",
                        "Can you walk to Patan Durbar Square from Thamel?",
                        "How can you reach Patan Durbar Square by car or taxi?",
                        "What public transportation options are available to reach Patan Durbar Square?",
                        "Is it possible to reach Patan Durbar Square by bicycle?",
                        "how to reach?"
                    ],
                    "responses": [
                        "Patan Durbar Square is easily accessible from various parts of the city, including Thamel, by taxi, rickshaw, or walking.",
                        " Thamel to Patan Durbar Square is 5-6km according to route. It takes about 1 hour to 1 hour 30 minutes by walking.",
                        "You can hire a car or taxi to take you close to the square; however, vehicles are not allowed inside the square area.",
                        "Public transportation is available, including buses and microbuses from Ratnapark, Sahid Gate, and nearby areas.",
                        "Yes, bicycles are allowed inside Patan Durbar Square, and you can rent a bike to explore the area."
                    ]
                },
                {"intent": "major attractions",
            "examples": ["major attraction", "important places", "cultural places", "attractions", "tourist activities", "mandir"
            ],
        "responses": ["Krishna Mandir, Bhimsen Temple, Vishwanath Temple, Patan museum are famous tourist attractions. "]
    },
    {
        "intent": "krishna.mandir",
        "examples":["krishna mandir", "tell me about krishna mandir"
    ], 
    "responses": ["Krishna Mandir is one of the most important temple in Patan Durbar Square. A three-storied structure, it was built in the local variety of Shikhara style called Granthakuta. The stone carvings along the beam above the first and second-floor pillar are most notable. The first-floor pillar carvings narrate the events of the Mahabharata, while on the second floor there are visual carvings from Ramayana.The temple was built in 1667 by King Siddhi Narsingh Malla. It is said that one night the King saw Lord Krishna and his consort Srimati Radha standing in front of the royal palace. He ordered a temple to be built on the same spot. There are 21 golden pinnacles in the temple. Below the pinnacles are three stories. The first floor holds the main shrine of Lord Krishna with shrines of Radha and Rukmini at each side. The second floor is dedicated to Lord Shiva and the third to Lokeshwor (Avalokiteshvara).The square is crowded with thousands of Hindu Pilgrims and devotees during Krishnastami."]
    }, 
    {"intent": "patan.temples",
    "examples": ["temples in patan", "patan temples", "temple", "temples", "bhimsen temple", "vishwanath temple"
    ],
"responses": ["Bhimsen Temple: Bhimsen (Bhin : dya) Temple was built by Srinivasa Malla in 1680. It is renowned for its three interconnected golden windows. Bhimsen is a great personality in Mahabharata. He is the second-born son of Kunti and King Pandu, and one of the five Pandavas, known for his bravery and strength. Newa people worship him as a god of business and trade. Tourists are not allowed inside the temple. Photos are also not allowed to be taken inside the temple\n Vishwanath Temple: Vishwanath Temple is dedicated to Lord Shiva. It was built in 1627 AD during the reign of Siddhi Narsingh Malla. The roof supports are decorated with erotic carvings similar to imagery widespread in Shiva temples in India. The temple is guarded by two stone elephants in the front entrance. On the other side of the temple is the sculpture of a bull, Shiva's vehicle. A stone linga is enshrined inside the temple.[1][19][20] It is located between Krishna Mandir and Bhimsen Temple."]
}
            ]
        },

        {
            "intent": "about_swayambhunath",
            "examples": [
                "Tell me about Swayambhunath",
                "What is Swayambhunath?",
                "Swayambhunath", "swayambhunath", 
                "swayambhu", "swayambunath",
                "monkey temple"
            ],
            "responses": [
                "Swayambhunath, also known as the Monkey Temple, is an ancient religious complex atop a hill in the Kathmandu Valley. It is a UNESCO World Heritage Site and a sacred site for both Buddhists and Hindus."
            ],
            "follow_up_questions": [
                {
                    "intent": "more",
            "examples": ["more", "more about swayambhu", "more about monkey temple"
            ],
        "responses": ["Swayambhunath, also known as the Monkey Temple, is one of the most iconic religious sites in Nepal, located atop a hill overlooking the Kathmandu Valley. The stupa’s name 'Swayambhu' means 'self-existent,' referring to its miraculous origin. According to legend, it emerged from the center of the Kathmandu Valley, once a vast lake, as a divine lotus flower. \n The stupa itself features a large golden spire with Buddha's all-seeing eyes painted on all four sides, symbolizing the Buddha's omnipresence. The site also contains numerous shrines, statues, and stupas, blending Hindu and Buddhist elements. Visitors climb 365 steps to reach the stupa, offering stunning views of the valley. \n Swayambhunath has been a pilgrimage site for centuries, with both Buddhists and Hindus worshipping here. It is known for its monkeys, who roam the site and are considered sacred. The area is home to Tibetan Buddhist monasteries, offering insight into Buddhist culture and teachings.\n The site is a UNESCO World Heritage Site and a center for cultural events, religious festivals, and local traditions. It remains a peaceful and serene place, offering visitors a chance for reflection and spiritual connection, making it a must-visit destination in Kathmandu." ]
    },
                {
                    "intent": "ask_about_where_is_swayambhunath_located",
                    "examples": [
                        "Where is Swayambhunath located?",
                        "location"
                    ],
                    "responses": [
                        "Swayambhunath is located in Swayambhu, Kathmandu, Nepal.Swayambhunath is located approximately 2 kilometers west of Kathmandu Durbar Square, atop a hill in the Kathmandu Valley. It stands at an elevation of about 77 meters (253 feet) above the valley floor, offering panoramic views of the Kathmandu Valley. The site is accessible by a steep climb of 365 steps or by road, making it a prominent landmark in the city. "
                    ]
                },
                
            
                {
                    "intent": "ask_about_who_is_manjushri",
                    "examples": [
                        "Who is Manjushri?",
                        "manjushree",
                        "manjushri"
                    ],
                    "responses": [
                        "Manjushri is a prominent figure in Buddhist mythology and is considered a bodhisattva of wisdom. In Mahayana Buddhism, Manjushri represents the embodiment of wisdom and insight, often depicted wielding a sword that cuts through ignorance and delusion. The sword symbolizes the cutting away of confusion, revealing the truth of reality. Manjushri is also shown holding a book or scroll in his left hand, symbolizing the wisdom teachings.\n n the context of Tibetan Buddhism, Manjushri is highly revered and believed to have played a role in transmitting the Buddha's teachings. He is often invoked by practitioners seeking to enhance their understanding and develop wisdom."
                    ]
                },
                {
                    "intent": "swayambhu.attractions",
                    "examples": [
                        "major attraction", "major attractions", "attraction", "places to visit"
                    ],
                    "responses": [
                       " Swayambhunath, also known as the Monkey Temple, is one of the most iconic and sacred Buddhist sites in Nepal. Located on a hilltop in Kathmandu, it offers breathtaking views of the city and is a UNESCO World Heritage Site.\n The centerpiece of the site, the white dome and golden spire represent enlightenment.\n The all-seeing eyes of Buddha symbolize wisdom and awareness."
                    ]
                },
                {
                    "intent": "ask_about_why_are_the_monkeys",
                    "examples": [
                        "Why are the monkeys at Swayambhunath considered holy?",
                        "monkeys"
                    ],
                    "responses": [
                        "Monkeys are considered holy because they are believed to have come from Manjushri’s head lice when he grew his hair long."
                    ]
                },
                {
                    "intent": "ask_about_who_is_believed_to",
                    "examples": [
                        "Who is believed to have founded Swayambhunath?",
                        "founder"
                    ],
                    "responses": [
                        "King Vrsadeva, the great-grandfather of King Mānadeva, is believed to have founded Swayambhunath in the 5th century CE."
                    ]
                },
                {
                    "intent": "swayambhu.architecture",
                    "examples": [
                       "architecture", "swayambhunath architecture", "swayambhu archutecture"
                    ],
                    "responses": [
                        "Swayambhunath, also known as the Monkey Temple, features a dome-shaped stupa with a golden spire adorned with Buddha's all-seeing eyes. The structure represents the five elements—earth, water, fire, air, and space—blending traditional Nepalese and Tibetan Buddhist styles. Surrounding the stupa are prayer wheels, smaller shrines, and statues, with intricately carved wooden toranas at the entrances."
                    ]
                },
                {
                    "intent": "swayambhu.culture",
                    "examples": [
                       "culture", "swayambhunath culture", "swayambhu culture", "festivals"
                    ],
                    "responses": [
                        "Pilgrims and monks perform Kora (circumambulation) around the stupa while spinning prayer wheels.\n Devotees light butter lamps and offer prayers in the morning and evening.\n Chanting of Buddhist mantras like 'Om Mani Padme Hum' echoes throughout the site.\n Buddha Jayanti: Celebrates the birth of Lord Buddha with special prayers, butter lamp offerings, and processions at Swayambhunath."
                    ]
                },
                {
                    "intent": "openingtime.and.entryfee",
                    "examples": [
                        "when does it open?", "opening hours and entry fee", "opening hours", "entry fee", "entry fees", "visiting hours", "opening time"
                    ],
                    "responses": [ "It opens 24 hours a day. \n Entry Fees: Foreign Nationals: NPR 200 ,SAARC Nationals: NPR 50 \n Nepalese Citizens: Free "
                    ]
                },
                {
                    "intent": "ask_about_which_hindu_deity_is",
                    "examples": [
                        "Which Hindu deity is associated with Swayambhunath?", "is swayambhu only for buddha",
                        "is it only for buddhist", "can hindu go?"
                    ],
                    "responses": [
                        "Harati Devi, the goddess of smallpox and children, is associated with Swayambhunath. People of all religion can visit Swayambhu."
                    ]
                },
                {
                    "intent": "ask_about_how_do_pilgrims_worship",
                    "examples": [
                        "How do pilgrims worship at Swayambhunath?", "worship"
                    ],
                    "responses": [
                        "Pilgrims ascend the eastern steps before dawn and perform clockwise circumambulations of the stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_significance",
                    "examples": [
                        "What is the significance of Swayambhunath to Newar Buddhists?", "significance"
                    ],
                    "responses": [
                        "Swayambhunath is the most sacred site for Buddhist Newars."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_tibetan",
                    "examples": [
                        "What is the Tibetan name for Swayambhunath and its meaning?", "tibetian", "another name for swayambhu"
                    ],
                    "responses": [
                        "The Tibetan name is 'Phags.pa Shing.kun,' meaning 'Sublime Trees.'"
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_main",
                    "examples": [
                        "What is the main structure of Swayambhunath called?"
                    ],
                    "responses": [
                        "The main structure is called a stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_do_the_eyes",
                    "examples": [
                        "What do the eyes painted on the stupa represent?", "eyes of buddha", "eyes"
                    ],
                    "responses": [
                        "The eyes represent wisdom and compassion."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_dome",
                    "examples": [
                        "What does the dome at the base of the stupa symbolize?", "dome"
                    ],
                    "responses": [
                        "The dome represents the entire world."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_significance",
                    "examples": [
                        "What is the significance of the number thirteen on the stupa?", "number 13"
                    ],
                    "responses": [
                        "The thirteen tiers symbolize the thirteen stages to enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the Buddhist scripture associated with Swayambhunath?"
                    ],
                    "responses": [
                        "Swayambhu Purana is the Buddhist scripture associated with the site."
                    ]
                },
                {
                    "intent": "ask_about_who_led_the_reconstruction",
                    "examples": [
                        "Who led the reconstruction of the stupa in the 15th century?"
                    ],
                    "responses": [
                        "Śāriputra led the reconstruction in the 15th century."
                    ]
                },
                {
                    "intent": "ask_about_which_valley_was_swayambhunath",
                    "examples": [
                        "Which valley was Swayambhunath said to have emerged from according to mythology?"
                    ],
                    "responses": [
                        "It emerged from a lake that once filled the Kathmandu Valley."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the bodhisattva associated with the monkeys at Swayambhunath?"
                    ],
                    "responses": [
                        "Manjushri is the bodhisattva associated with the monkeys."
                    ]
                },
                {
                    "intent": "ask_about_what_major_event_damaged",
                    "examples": [
                        "What major event damaged the Swayambhunath complex in 2015?"
                    ],
                    "responses": [
                        "The 2015 Nepal earthquake damaged the complex."
                    ]
                },
                {
                    "intent": "ask_about_what_was_used_to",
                    "examples": [
                        "What was used to re-gild the Swayambhu Shrine in 2010?"
                    ],
                    "responses": [
                        "20 kg of gold was used to re-gild the shrine."
                    ]
                },
                {
                    "intent": "ask_about_which_king_is_associated",
                    "examples": [
                        "Which king is associated with building the eastern stairway?"
                    ],
                    "responses": [
                        "King Pratap Malla built the eastern stairway."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_nepali",
                    "examples": [
                        "What is the Nepali number depicted as a nose on the stupa?"
                    ],
                    "responses": [
                        "The Nepali number 'one' is depicted as a nose."
                    ]
                },
                {
                    "intent": "ask_about_how_many_pentagonal_toranas",
                    "examples": [
                        "How many pentagonal toranas are present above the cube structure?"
                    ],
                    "responses": [
                        "There are pentagonal toranas on all four sides."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_third",
                    "examples": [
                        "What does the third eye on the stupa represent?"
                    ],
                    "responses": [
                        "The third eye symbolizes cosmic rays and spiritual awakening."
                    ]
                },
                {
                    "intent": "ask_about_which_buddhist_tradition_mainly",
                    "examples": [
                        "Which Buddhist tradition mainly influences Swayambhunath’s iconography?"
                    ],
                    "responses": [
                        "Vajrayana tradition mainly influences its iconography."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_main",
                    "examples": [
                        "What is the main ritual practice performed by pilgrims at Swayambhunath?"
                    ],
                    "responses": [
                        "Pilgrims perform clockwise circumambulations around the stupa."
                    ]
                },
                {
                    "intent": "ask_about_which_bodhisattva_had_a",
                    "examples": [
                        "Which bodhisattva had a vision of the lotus at Swayambhu?"
                    ],
                    "responses": [
                        "Manjushri had a vision of the lotus at Swayambhu."
                    ]
                },
                {
                    "intent": "ask_about_which_empire’s_ruler_is",
                    "examples": [
                        "Which empire’s ruler is said to have built a temple on Swayambhunath hill?"
                    ],
                    "responses": [
                        "Emperor Ashoka of the Maurya Empire built a temple on the hill."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_alternative",
                    "examples": [
                        "What is the alternative name for Swayambhunath?"
                    ],
                    "responses": [
                        "It is also called Swayambhu or Swoyambhu."
                    ]
                },
                {
                    "intent": "ask_about_who_was_king_vṛsadeva,",
                    "examples": [
                        "Who was King Vṛsadeva, and what is his connection to Swayambhunath?"
                    ],
                    "responses": [
                        "King Vṛsadeva, the great-grandfather of King Mānadeva, is believed to have founded Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_shape",
                    "examples": [
                        "What is the shape of the stupa's base?",
                        "shape"
                    ],
                    "responses": [
                        "The base is dome-shaped."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the goddess temple located near the stupa?",
                        "what temple near stupa?"
                    ],
                    "responses": [
                        "Harati Devi's temple is near the stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_panch",
                    "examples": [
                        "What are the Panch Buddhas, and where are they represented on the stupa?",
                        "5 buddhas",
                        "five buddhas"
                    ],
                    "responses": [
                        "Panch Buddhas represent five Buddhas, depicted on all four sides and at the base."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_daily",
                    "examples": [
                        "What are the daily practices observed by visitors to Swayambhunath?"
                    ],
                    "responses": [
                        "Visitors perform kora (circumambulation), light butter lamps, and offer prayers."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_opening",
                    "examples": [
                        "What are the opening hours of Swayambhunath?",
                        "opening hours", "visiting hours",
                        "when does it open?", "opening time"
                    ],
                    "responses": [
                        "Swayambhunath is open from early morning around 5 AM to 7 PM in the evening."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_entry",
                    "examples": [
                        "What is the entry fee for Swayambhunath?",
                        "entry fee"
                    ],
                    "responses": [
                        "Nepali citizens do not need to pay an entry fee to visit Swayambhunath but entry fee may differ to foreign citizens. Rs. 50 for SAARC nationals and Rs. 200 for others."
                    ]
                },
                {
                    "intent": "ask_about_how_can_i_reach",
                    "examples": [
                        "How can I reach Swayambhunath from Kathmandu city center?",
                        "how to go?",
                        "transportaion"
                    ],
                    "responses": [
                        "You can reach Swayambhunath via taxi, bus, or by walking from Kathmandu Durbar Square, approximately 3 km away."
                    ]
                },
                {
                    "intent": "ask_about_is_there_parking_available",
                    "examples": [
                        "Is there parking available near Swayambhunath?",
                        "parking"
                    ],
                    "responses": [
                        "Yes, there is parking available near the southern entrance of Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_how_many_steps_are",
                    "examples": [
                        "How many steps are there to climb to Swayambhunath?",
                        "steps"
                    ],
                    "responses": [
                        "There are approximately 365 steps leading up to Swayambhunath from the eastern side."
                    ]
                },
                {
                    "intent": "ask_about_is_photography_allowed_at",
                    "examples": [
                        "Is photography allowed at Swayambhunath?",
                        "photographs"
                    ],
                    "responses": [
                        "Yes, photography is allowed, but drones may require permission."
                    ]
                },
                {
                    "intent": "ask_about_can_i_buy_souvenirs",
                    "examples": [
                        "Can I buy souvenirs at Swayambhunath?"
                    ],
                    "responses": [
                        "Yes, there are many stalls selling souvenirs, prayer wheels, and handicrafts."
                    ]
                },
                {
                    "intent": "ask_about_are_there_any_nearby",
                    "examples": [
                        "Are there any nearby attractions to Swayambhunath?"
                    ],
                    "responses": [
                        "Nearby attractions include Kathmandu Durbar Square, Boudhanath Stupa, and Pashupatinath Temple."
                    ]
                }
            ]
        },
        {
            "intent": "about_thamel",
            "examples": [
              "Tell me about Thamel",
              "What is Thamel?",
              "Thamel market",
              "Thamel area", "thamel",
              "Thamel Kathmandu"
            ],
            "responses": [
              "Thamel is a vibrant and bustling tourist district in the heart of Kathmandu, Nepal. Known for its lively atmosphere, it is the go-to destination for tourists and locals alike. Thamel offers a variety of shops, restaurants, hotels, and cultural experiences, making it one of the most popular areas in Kathmandu. From traditional Nepali handicrafts to international brands, you can find a wide range of goods. The streets are filled with tourists, locals, and vendors, creating a dynamic and colorful environment."
            ],
            "follow_up_questions": [
              {
                "intent": "more",
                "examples": [
                  "more about Thamel",
                  "tell me more about Thamel"
                ],
                "responses": [
                  "Thamel is also famous for its lively nightlife, with a wide range of bars, restaurants, and clubs. During the day, you can explore the narrow streets lined with traditional shops selling everything from trekking gear to souvenirs. In the evening, Thamel comes alive with music and energy, offering a variety of dining options, live music venues, and vibrant nightlife spots. It's also a great place to experience local culture, with plenty of traditional Nepalese restaurants and shops selling handcrafted goods."
                ]
              },
              {
                "intent": "ask_about_food",
                "examples": [
                  "What food can I try in Thamel?",
                  "What is the food like in Thamel?",
                  "food in Thamel", "food"
                ],
                "responses": [
                  "Thamel is home to a diverse selection of food options. You can try traditional Nepalese dishes such as momo (dumplings), dal bhat (lentil soup with rice), and thukpa (noodle soup). The area also offers international cuisines, including Indian, Tibetan, Italian, and Western food. Whether you're looking for street food or fine dining, Thamel has something for every taste."
                ]
              },
              {
                "intent": "ask_about_culture",
                "examples": [
                  "What is the culture of Thamel?",
                  "Tell me about the culture in Thamel",
                  "culture of Thamel", "culture"
                ],
                "responses": [
                  "Thamel is a cultural hub in Kathmandu, where you can experience a blend of traditional Nepali and international influences. The area is home to many temples, shrines, and monuments, offering insight into Nepal's rich history and spiritual heritage. You can also explore local markets where artisans sell traditional handicrafts such as pottery, thangkas, and wood carvings. The vibrant streets reflect the fusion of old and new, with ancient temples standing next to modern cafes and boutiques."
                ]
              },
              {
                "intent": "ask_about_clubs_and_nightlife",
                "examples": [
                  "What are the best clubs in Thamel?",
                  "Is there nightlife in Thamel?",
                  "Clubs and nightlife in Thamel", "night life", "clubs", "funfact"
                ],
                "responses": [
                  "Thamel has a lively nightlife scene with a variety of clubs, bars, and live music venues. Popular places to check out include 'The Rum Doodle,' 'Kathmandu Pub,' and 'Purple Haze.' You can enjoy live performances, DJ sets, and dance floors that keep the energy high late into the night. Whether you're looking for a relaxed evening in a rooftop bar or a lively night out dancing, Thamel has something for every nightlife enthusiast."
                ]
              },
              {
                "intent": "ask_about_shopping",
                "examples": [
                  "Can I shop in Thamel?",
                  "What can I buy in Thamel?",
                  "Shopping in Thamel", "what to buy", "souvenirs"
                ],
                "responses": [
                  "Thamel is a popular shopping destination, with a variety of shops offering a range of goods. You can find everything from trekking gear and clothing to traditional Nepalese handicrafts, jewelry, and souvenirs. The streets are lined with shops selling items like pashmina scarves, singing bowls, hand-carved woodwork, and incense. It's a great place to pick up unique gifts and souvenirs while exploring the vibrant market atmosphere."
                ]
              },
              {
                "intent": "ask_about_transportation",
                "examples": [
                  "How do I get to Thamel?",
                  "What is the best way to reach Thamel?",
                  "Transportation to Thamel", "transportaion"
                ],
                "responses": [
                  "Thamel is easily accessible from any part of Kathmandu. You can take a taxi, rickshaw, or use local buses to reach Thamel. If you're staying in the tourist district of Kathmandu, it's likely that Thamel is within walking distance. For those arriving from the airport, taxis and private cars are readily available to take you to Thamel."
                ]
              },
              {
                "intent": "ask_about_best_time_to_visit",
                "examples": [
                  "When is the best time to visit Thamel?",
                  "What is the best time of day to visit Thamel?",
                  "when to visit Thamel?"
                ],
                "responses": [
                  "Thamel is a popular destination year-round, but the best time to visit is during the cooler months between October and March. The weather is more comfortable for walking around and exploring the area. If you prefer a quieter experience, early mornings are great, but if you're looking for a bustling atmosphere, evening time when the nightlife kicks in is ideal."
                ]
              }
            ]
          } , 
          {
            "intent": "about_hiking_in_champadevi",
            "examples": [
              "Tell me about hiking in Champadevi",
              "Is there hiking at Champadevi?",
              "What is the hike like in Champadevi?",
              "Hiking in Champadevi",
              "champadevi"
            ],
            "responses": [
              "Champadevi is a popular beginner friendly hiking destination located just outside of Kathmandu Valley, offering a peaceful escape into nature. The hike to Champadevi is moderately challenging and is often chosen by both locals and tourists. It takes you through lush forests, with plenty of opportunities to enjoy panoramic views of the surrounding hills, the Kathmandu Valley, and even the distant Himalayan ranges. Along the way, you’ll encounter ancient shrines and scenic spots perfect for photography or taking a rest. This is an excellent hike for nature lovers and those looking for a relatively peaceful escape from the city."
            ],
            "follow_up_questions": [
              {
                "intent": "more_about_hiking",
                "examples": [
                  "Tell me more about the hike at Champadevi",
                  "What else can I expect on the hike?", 
                  "more", "details", "what else?", "how long does it take?"
                ],
                "responses": [
                  "The hike to Champadevi takes around 3 to 4 hours to complete, depending on your pace, and covers a distance of about 6-7 kilometers. The trail begins from the Godawari area and ascends steadily through dense forests filled with a variety of plant species, birds, and wildlife. As you approach the summit, you'll enjoy breathtaking views of the Kathmandu Valley, Phulchoki Hill, and the mountains on the horizon. At the top, there is a small temple dedicated to Goddess Champadevi, making it a spiritual as well as scenic journey. The area around the summit is serene and offers a perfect place for meditation or a quiet break."
                ]
              },
              {
                "intent": "ask_about_guides_for_hiking_in_champadevi",
                "examples": [
                  "Do I need a guide to hike in champadevi?",
                  "Are there guides available for hiking in champadevi",
                  "Can I hire a guide for hiking in champadevi?", 
                  "guides", "guide"
                ],
                "responses": [
                  "While hiking in Champadevi is generally safe and well-marked, hiring a guide can enhance your experience, especially if you are unfamiliar with the area or want more insights about the local flora, fauna, and culture. Guides are available in Kathmandu, and they can offer additional services such as transportation to the trailheads. A guide can also ensure your safety, help you navigate the trails, and provide local knowledge about the park’s history and ecology."
                ]
              },
              {
                "intent": "ask_about_difficulty_of_hike",
                "examples": [
                  "Is hiking to Champadevi difficult?",
                  "How tough is the hike to Champadevi?",
                  "Is it easy to hike to Champadevi?",
                  "how difficult", "difficulty"
                ],
                "responses": [
                  "The hike to Champadevi is moderate in difficulty. It involves a steady ascent, and while the trail is well-maintained, it can get tiring due to the continuous uphill climb. The terrain varies from smooth paths to slightly rocky sections, and the hike may be challenging for beginners, but it is manageable for most people with average fitness levels. The scenic views and peaceful surroundings make the effort worth it."
                ]
              },
              {
                "intent": "ask_about_surroundings_of_hike",
                "examples": [
                  "What can I see while hiking to Champadevi?",
                  "What are the surroundings like when hiking up to Champadevi?",
                  "Can I see any wildlife while hiking to Champadevi?"
                ],
                "responses": [
                  "During the hike, you'll be surrounded by beautiful nature, with dense forests of oak, rhododendron, and pine trees. The trail is also home to various wildlife, including birds, monkeys, and occasional sightings of other animals. As you ascend, you’ll have stunning views of the Kathmandu Valley, and on clear days, the Himalayan ranges come into view. The final stretch offers spectacular views of the surrounding hills and valleys. At the summit, the Champadevi temple offers a peaceful atmosphere and a great spot to reflect and enjoy the view."
                ]
              },
              {
                "intent": "camping.at.champadevi",
                "examples": [
                  "Can i camp at Champadevi?",
                  "Camping in champadevi", "camping",
                  " Champadevi camping", "Is camping allowed on Champadevi Hill?",
                  "Are there designated camping spots at Champadevi?",
                   "Do I need a permit for camping in Champadevi?"
                ],
                "responses": [
                  "Yes, you can camp at the top of Champadevi, but there are no official campsites, so you will need to bring your own gear.No special permit is required for camping at Champadevi, but it's always a good idea to inform locals or authorities about your plans."
                ]
              },
              {
                "intent": "starting.point",
                "examples": [
                  "Starting point of hike in Champadevi?",
                 "How do i get to champadevi camping site?",
                  "Route to champadevi", "hiking route to champadevi"
                   ],
                "responses": [
                  "You can start your hike from Pharping or Hattiban Resort, which are common starting points. The hike takes 2-3 hours to reach the summit."
                ]
              }

            ]
          },
          {
            "intent": "about_rock_climbing_in_nagarjun",
            "examples": [
              "Tell me about rock climbing in Nagarjun",
              "Is there rock climbing in Nagarjun?",
              "Where can I do rock climbing in Nagarjun?",
              "What is rock climbing like in Nagarjun?"
            ],
            "responses": [
              "Nagarjun is a popular spot for outdoor enthusiasts, offering a variety of activities including rock climbing. It is beginner friendly. The area around Nagarjun, particularly in the Nagarjun Forest Reserve, features several climbing routes with varying levels of difficulty. The rocky terrain and natural cliffs make it an ideal location for both beginners and experienced climbers. The region offers a beautiful and serene environment for those seeking adventure while enjoying the natural surroundings. You'll also find opportunities to hike and explore the nearby Nagarjun Hill, which adds to the charm of this climbing destination."
            ],
            "follow_up_questions": [
              {
                "intent": "more_about_rock_climbing_routes",
                "examples": [
                  "Tell me more about the rock climbing routes in Nagarjun",
                  "What are the climbing routes like in Nagarjun?",
                  "Can you describe the rock climbing spots in Nagarjun?", "more"
                ],
                "responses": [
                  "The rock climbing routes in Nagarjun vary from beginner-friendly climbs to more challenging options for experienced climbers. Many of the routes are set up in the natural rock formations found around the forest reserve. The routes typically offer great holds and provide a mix of technical moves, overhangs, and ledges. Some of the more popular climbing areas are near the Nagarjun forest entrance, while others require a short hike into the reserve. Depending on your skill level, you'll find a suitable challenge among the routes available."
                ]
              },
              {
                "intent": "ask_about_climbing_difficulty",
                "examples": [
                  "How difficult is rock climbing in Nagarjun?",
                  "Is rock climbing in Nagarjun easy or hard?",
                  "What is the difficulty level of climbing in Nagarjun?", "easy or hard"
                ],
                "responses": [
                  "Rock climbing in Nagarjun offers a range of difficulties. For beginners, there are easier routes with manageable rock faces and gentle inclines. For intermediate and advanced climbers, there are more challenging routes that include technical moves and steeper, more rugged terrains. The climbing spots cater to various skill levels, so it's important to assess your experience before tackling a route. It's also recommended to climb with proper gear and possibly with an experienced guide if you're new to the area."
                ]
              },
              {
                "intent": "ask_about_gear_and_guide_for_climbing",
                "examples": [
                  "Do I need special gear for rock climbing in Nagarjun?",
                  "Can I get a climbing guide in Nagarjun?",
                  "What gear should I bring for climbing in Nagarjun?", "what is needed", "what do i need"
                ],
                "responses": [
                  "For rock climbing in Nagarjun, you'll need proper climbing gear, including climbing shoes, chalk, a harness, and a rope, especially if you're planning to climb technical routes. There are climbing shops in Kathmandu where you can rent or buy equipment. It's also advisable to climb with a guide, particularly if you're unfamiliar with the area or new to climbing. A guide can provide safety instructions, route recommendations, and ensure that you're climbing safely. Many local climbing companies offer guided tours for both beginners and advanced climbers."
                ]
              },
              {
                "intent": "how.to.get",
                "examples": [
                  "How to get to Nagarjun?",
                  " Nagarjun rock climbing site",
                "Nagarjun rock climbing route"
                ],
                "responses": [
                  "You can reach the site by taxi, private vehicle, or local bus from Kathmandu to the Balaju Bypass area, then hike or drive to the climbing spot inside the national park."
                ]
              },
              {
                "intent": "cost_and_permit",
                "examples": [
                 "cost for rock climbing in nagarjun",
                 "cost", "price", "pay", "permit", "permission",
                 "do i need a permit to climb nagarjun"
                ],
                "responses": [
                  "Yes, you need an entry permit for Shivapuri Nagarjun National Park, which costs Rs. 100 for Nepalese, Rs. 600 for SAARC nationals, and Rs. 1000 for foreigners."
                ]
              }
            ]
          },
          {
            "intent": "about_mountain_biking_in_kathmandu_valley",
            "examples": [
              "Tell me about mountain biking in Kathmandu Valley",
              "Where can I go mountain biking in Kathmandu?",
              "What is mountain biking like in Kathmandu Valley?",
              "Is Kathmandu Valley good for mountain biking?", "mountain biking"
            ],
            "responses": [
              "Kathmandu Valley offers some of the best mountain biking routes in Nepal, combining scenic views, diverse terrains, and challenging climbs. The valley is surrounded by hills and mountains, making it ideal for biking enthusiasts who want to experience both nature and culture. Routes like the Shivapuri National Park, Nagarkot, and the hills around Kathmandu Valley offer a mix of off-road trails, single tracks, and forest paths. Whether you're a beginner or an advanced rider, there are routes that cater to all levels, making it a popular destination for mountain biking tours."
            ],
            "follow_up_questions": [
              {
                "intent": "ask_about_mountain_biking_routes",
                "examples": [
                  "What are the best mountain biking routes in Kathmandu Valley?",
                  "Can you tell me about biking routes in Kathmandu?",
                  "What are the popular biking trails in Kathmandu?", "routes"
                ],
                "responses": [
                  "Some of the best mountain biking routes in Kathmandu Valley include:\n\n1. **Shivapuri National Park** – A popular spot for both beginners and intermediate riders, offering a variety of single tracks and forest trails.\n2. **Nagarkot** – A scenic ride with breathtaking views of the Himalayas and a variety of uphill and downhill routes.\n3. **Bungamati and Khokana** – Traditional villages that offer a unique biking experience through narrow streets and rural trails.\n4. **Chobar** – A great route for technical mountain bikers, featuring steep climbs and challenging terrain.\n5. **Sundarijal to Chisapani** – A long and challenging ride through forests and hills, perfect for more experienced riders."
                ]
              },
              {
                "intent": "ask_about_difficulty_level_of_biking_routes",
                "examples": [
                  "How difficult are the mountain biking routes in Kathmandu Valley?",
                  "Is mountain biking in Kathmandu Valley easy or hard?",
                  "What is the difficulty level of biking in Kathmandu Valley?", "difficulty"
                ],
                "responses": [
                  "Mountain biking in Kathmandu Valley offers routes for all skill levels. For beginners, there are relatively flat, easy-to-ride routes, especially in areas like Shivapuri National Park or around the valley's rural villages. For intermediate riders, there are more challenging climbs and technical terrain in places like Nagarkot or Chobar. Advanced riders can enjoy difficult, steep, and off-the-beaten-path trails that offer a thrilling experience with technical descents and strenuous climbs. Depending on your experience level, you can choose routes that suit your abilities."
                ]
              },
              {
                "intent": "ask_about_biking_gear_and_rentals",
                "examples": [
                  "Can I rent a bike in Kathmandu?",
                  "What biking gear should I bring to Kathmandu?", "need",
                  "Where can I rent a mountain bike in Kathmandu?", "what do i need", "what is needed"
                ],
                "responses": [
                  "Yes, you can easily rent a mountain bike in Kathmandu. There are several bike shops in Thamel and other parts of Kathmandu that offer a range of mountain bikes for all levels. You can also rent necessary gear such as helmets, gloves, and protective pads. For a more tailored experience, you can also hire a guide who will take you on biking tours around the valley, providing both the bike and all necessary safety equipment. It’s important to ensure that the bike is in good condition, especially if you plan to tackle more challenging trails."
                ]
              },
              {
                "intent": "ask_about_guided_biking_tours",
                "examples": [
                  "Can I do a guided mountain biking tour in Kathmandu?",
                  "Are there biking tours available in Kathmandu Valley?",
                  "Do I need a guide for mountain biking in Kathmandu?", "tours", "guides"
                ],
                "responses": [
                  "Guided mountain biking tours are popular in Kathmandu Valley, especially for those who are unfamiliar with the terrain or want to explore the area with an expert. Many companies in Kathmandu offer guided tours that cater to different skill levels, from half-day rides to multi-day expeditions. A guide will provide you with a bike, gear, and safety instructions while leading you on some of the most scenic and challenging routes. It's an excellent option for those who want to ensure a safe and memorable biking experience in the valley."
                ]
              }
            ]
          },
          {
            "intent": "about_hiking_in_shivapuri_national_park",
            "examples": [
              "Tell me about hiking in Shivapuri National Park",
              "Where can I go hiking in Shivapuri National Park?",
              "What is hiking like in Shivapuri National Park?",
              "Is Shivapuri National Park good for hiking?", "shivpuri national park"
            ],
            "responses": [
              "Shivapuri National Park is one of the most popular destinations for hiking near Kathmandu. Located just to the north of the city, it offers an incredible escape into nature, with lush forests, diverse wildlife, and stunning panoramic views of the Kathmandu Valley and the surrounding Himalayan ranges. The park is home to numerous trails suitable for hikers of various skill levels, from easy walks to more challenging treks. Hiking here allows you to experience both natural beauty and cultural heritage, with options to visit monasteries, waterfalls, and traditional villages."
            ],
            "follow_up_questions": [
              {
                "intent": "ask_about_hiking_routes_in_shivapuri",
                "examples": [
                  "What are the best hiking routes in Shivapuri National Park?",
                  "Can you tell me about hiking trails in Shivapuri?",
                  "What hiking trails are popular in Shivapuri National Park?", "more"
                ],
                "responses": [
                  "Some of the popular hiking routes in Shivapuri National Park include:\n\n1. **Shivapuri Peak** – The most famous trail, offering an uphill climb to the summit of Shivapuri Peak (2,565 meters). The trail passes through dense forests, providing spectacular views of the valley and the surrounding mountains.\n2. **Nagarjun Forest** – A moderate hike that takes you through beautiful forest paths and rewards you with scenic views of the valley and Kathmandu city.\n3. **Kapan Monastery Trail** – A short, peaceful hike leading to the Kapan Monastery, offering cultural and spiritual insights along with a beautiful walk through the forest.\n4. **The Bagdwar Trail** – A more peaceful and less trafficked route leading to the Bagdwar, a sacred spring believed to be the source of the Bagmati River."
                ]
              },
              {
                "intent": "ask_about_difficulty_of_hiking_in_shivapuri",
                "examples": [
                  "How difficult are the hikes in Shivapuri National Park?",
                  "Is hiking in Shivapuri easy or hard?",
                  "What is the difficulty level of hikes in Shivapuri?", "difficulty"
                ],
                "responses": [
                  "Hiking in Shivapuri National Park offers options for all levels of hikers. For beginners, there are easier, shorter routes like the Kapan Monastery trail, which is a peaceful and gentle hike. For more experienced hikers, the Shivapuri Peak route is more challenging, with a steep uphill climb to the summit. The difficulty of the hike depends on the route you choose, but overall, Shivapuri provides a variety of terrains suitable for both novice and experienced hikers."
                ]
              },
              {
                "intent": "ask_about_best_time_for_hiking_in_shivapuri",
                "examples": [
                  "When is the best time to hike in Shivapuri National Park?",
                  "What is the best season for hiking in Shivapuri?",
                  "When should I go hiking in Shivapuri?", "best time"
                ],
                "responses": [
                  "The best time to hike in Shivapuri National Park is during the spring (March to May) and autumn (September to November) seasons. During these months, the weather is clear, with mild temperatures and great visibility, making it perfect for hiking. Winter (December to February) can be chilly, especially at higher elevations, while the monsoon season (June to August) brings heavy rain, which can make trails slippery and less enjoyable."
                ]
              },
              {
                "intent": "ask_about_entrance_fee_for_shivapuri_national_park",
                "examples": [
                  "Is there an entrance fee for Shivapuri National Park?",
                  "How much is the entrance fee to Shivapuri National Park?",
                  "Do I need to pay to hike in Shivapuri National Park?", "entry fee", "entry fees"
                ],
                "responses": [
                  "Yes, there is an entrance fee for Shivapuri National Park. The fee for foreigners is typically around NPR 1000 (subject to change), while for Nepali citizens, the fee is lower. You will also need to obtain a permit at the park's entrance gate. It's advisable to check the latest fee and permit information before your visit, as fees may change from time to time."
                ]
              },
              {
                "intent": "ask_about_guides_for_hiking_in_shivapuri",
                "examples": [
                  "Do I need a guide to hike in Shivapuri National Park?",
                  "Are there guides available for hiking in Shivapuri?",
                  "Can I hire a guide for hiking in Shivapuri?"
                ],
                "responses": [
                  "While hiking in Shivapuri National Park is generally safe and well-marked, hiring a guide can enhance your experience, especially if you are unfamiliar with the area or want more insights about the local flora, fauna, and culture. Guides are available in Kathmandu, and they can offer additional services such as transportation to the trailheads. A guide can also ensure your safety, help you navigate the trails, and provide local knowledge about the park’s history and ecology."
                ]
              }
            ]
          },
          {
            "intent": "about_paragliding_in_godavari",
            "examples": [
              "Tell me about paragliding in Godavari",
              "Where can I go paragliding in Godavari?",
              "Is paragliding available in Godavari?",
              "What is paragliding like in Godavari?", "paragliding"
            ],
            "responses": [
              "Godavari, located just south of Kathmandu, is a popular destination for paragliding enthusiasts. The location offers stunning aerial views of the surrounding hills, valleys, and the Kathmandu Valley. The takeoff point is usually from the nearby hills, and the flight offers a unique perspective of the lush greenery, the peaceful atmosphere of the area, and, on clear days, distant views of the Himalayas. Paragliding in Godavari is a thrilling yet peaceful experience, ideal for both beginners and experienced pilots."
            ],
            "follow_up_questions": [
              {
                "intent": "ask_about_best_time_for_paragliding_in_godavari",
                "examples": [
                  "When is the best time to go paragliding in Godavari?",
                  "What is the best season for paragliding in Godavari?",
                  "When should I go for paragliding in Godavari?", "best time", "more"
                ],
                "responses": [
                  "The best time for paragliding in Godavari is during the spring (March to May) and autumn (September to November). These seasons provide clear skies, mild temperatures, and excellent visibility, making them perfect for paragliding. The winter months (December to February) can be chilly, and the summer monsoon season (June to August) often brings rain, making it less ideal for flying."
                ]
              },
              {
                "intent": "ask_about_paragliding_schools_in_godavari",
                "examples": [
                  "Are there any paragliding schools in Godavari?",
                  "Can I take paragliding lessons in Godavari?",
                  "Where can I learn to paraglide in Godavari?", "paragliding lessons"
                ],
                "responses": [
                  "Yes, there are several paragliding schools and companies in Godavari that offer training for beginners as well as tandem paragliding flights for those looking for a thrilling experience without prior training. These schools provide experienced instructors, equipment rental, and safety training to ensure a safe and enjoyable flight. Some of the popular paragliding operators in the area include Godavari Paragliding and Nepal Paragliding."
                ]
              },
              {
                "intent": "ask_about_safety_for_paragliding_in_godavari",
                "examples": [
                  "Is paragliding safe in Godavari?",
                  "How safe is paragliding in Godavari?",
                  "Are there any safety concerns for paragliding in Godavari?", "safety", "is it safe"
                ],
                "responses": [
                  "Paragliding in Godavari is generally safe, especially when flying with a licensed and experienced company. Most operators follow strict safety protocols and use high-quality equipment. If you are a beginner, tandem flights with an experienced pilot are the safest way to enjoy the experience. It's always recommended to check the safety standards of the operator before booking your flight."
                ]
              },
              {
                "intent": "ask_about_cost_of_paragliding_in_godavari",
                "examples": [
                  "How much does paragliding cost in Godavari?",
                  "What is the price for paragliding in Godavari?",
                  "How much should I expect to pay for paragliding in Godavari?", "cost", "price", "fees"
                ],
                "responses": [
                  "The cost of paragliding in Godavari varies depending on whether you're taking a tandem flight or enrolling in a paragliding course. A tandem flight usually costs around NPR 8,000 to NPR 12,000 for a 15-30 minute flight. If you're looking to learn to paraglide, courses can cost between NPR 30,000 to NPR 50,000, depending on the duration and school."
                ]
              },
              {
                "intent": "ask_about_best_paragliding_operators_in_godavari",
                "examples": [
                  "Who are the best paragliding operators in Godavari?",
                  "Can you recommend a paragliding company in Godavari?",
                  "Which paragliding operators are trusted in Godavari?"
                ],
                "responses": [
                  "Some of the well-known and trusted paragliding operators in Godavari include:\n\n1. **Godavari Paragliding** – Known for their experienced pilots and excellent customer service.\n2. **Nepal Paragliding** – Offers tandem flights and training, ensuring top-quality equipment and safety.\n3. **Himalaya Paragliding** – Offers scenic flights and a variety of packages.\n4. **Fly Nepal** – A reliable option for both beginners and experienced pilots.\n\nAlways ensure the operator has a good safety record and reviews before booking your flight."
                ]
              }
            ]
          },
          {
            "intent": "about_canyoning_in_sundarijal",
            "examples": [
              "Tell me about canyoning in Sundarijal",
              "Where can I go canyoning in Sundarijal?",
              "Is canyoning available in Sundarijal?",
              "What is canyoning like in Sundarijal?",
              "What should I know about canyoning in Sundarijal?",
              "How do I get to Sundarijal for canyoning?", "canyoning", "sundarijal"
            ],
            "responses": [
              "Sundarijal, located in the northeastern part of the Kathmandu Valley, is a popular destination for canyoning enthusiasts. The area is known for its stunning natural landscapes, including waterfalls, deep gorges, and rocky terrain, which make it an ideal location for this adventure sport. Canyoning in Sundarijal involves descending through waterfalls and rocky streams using various techniques such as rappelling, jumping, and sliding down natural water slides. The experience offers a thrilling combination of adventure and scenic beauty, making it a must-try for adrenaline seekers."
            ],
            "follow_up_questions": [
              {
                "intent": "ask_about_best_time_for_canyoning_in_sundarijal",
                "examples": [
                  "When is the best time to go canyoning in Sundarijal?",
                  "What is the best season for canyoning in Sundarijal?",
                  "When should I go for canyoning in Sundarijal?"
                ],
                "responses": [
                  "The best time for canyoning in Sundarijal is during the dry seasons, typically from September to November and from February to May. During these months, the weather is pleasant, and the water levels are ideal for safe canyoning. The monsoon season (June to August) is not recommended, as the water levels can be high and dangerous, making the canyoning experience more risky."
                ]
              },
              {
                "intent": "ask_about_safety_for_canyoning_in_sundarijal",
                "examples": [
                  "Is canyoning safe in Sundarijal?",
                  "How safe is canyoning in Sundarijal?",
                  "Are there any safety concerns for canyoning in Sundarijal?", "more"
                ],
                "responses": [
                  "Canyoning in Sundarijal is generally safe when done with a licensed and experienced operator. Safety is a top priority, and most operators provide professional guides, safety gear (like helmets, harnesses, and ropes), and proper training. If you're a beginner, it’s highly recommended to go with a guided tour to ensure your safety and enjoyment. Always check the operator’s safety standards and reviews before booking."
                ]
              },
              {
                "intent": "ask_about_what_to_bring_for_canyoning_in_sundarijal",
                "examples": [
                  "What should I bring for canyoning in Sundarijal?",
                  "Do I need to bring anything for canyoning?",
                  "What to pack for canyoning in Sundarijal?"
                ],
                "responses": [
                  "For canyoning in Sundarijal, you should bring the following items:\n\n1. **Comfortable clothing**: Wear clothes that can get wet, such as quick-drying athletic wear.\n2. **Swimwear**: Essential if you plan to take part in the water activities.\n3. **Waterproof shoes**: Hiking shoes or sturdy sandals that provide good grip in slippery conditions.\n4. **Waterproof camera** (optional): To capture the adventure, if allowed by the operator.\n5. **Water bottle**: Stay hydrated during the activity.\n6. **Personal identification and insurance details**: For safety purposes and emergency situations."
                ]
              },
              {
                "intent": "ask_about_cost_of_canyoning_in_sundarijal",
                "examples": [
                  "How much does canyoning cost in Sundarijal?",
                  "What is the price for canyoning in Sundarijal?",
                  "How much should I expect to pay for canyoning in Sundarijal?"
                ],
                "responses": [
                  "The cost of canyoning in Sundarijal generally ranges from NPR 5,000 to NPR 12,000, depending on the operator and the type of package you choose. The price typically includes a guide, safety equipment, and transportation to and from the canyoning site. If you're opting for a more advanced canyoning experience or a full-day tour, the price may be higher."
                ]
              },
              {
                "intent": "ask_about_canyoning_operators_in_sundarijal",
                "examples": [
                  "Are there any canyoning operators in Sundarijal?",
                  "Can I go canyoning with a guide in Sundarijal?",
                  "Who are the canyoning operators in Sundarijal?"
                ],
                "responses": [
                  "Yes, there are several operators offering canyoning trips in Sundarijal. Some popular ones include:\n\n1. **Adventure Sports Nepal** – Known for their professional guides and great customer service.\n2. **Nepal Adventure Team** – Offers exciting canyoning packages with experienced guides.\n3. **Sundarijal Canyoning Adventure** – Specializes in canyoning tours in the Sundarijal area.\n\nMake sure to check reviews and safety standards before booking."
                ]
              },
              {
                "intent": "ask_about_duration_of_canyoning_in_sundarijal",
                "examples": [
                  "How long does canyoning in Sundarijal take?",
                  "What is the duration of a canyoning trip in Sundarijal?",
                  "How much time is required for canyoning in Sundarijal?"
                ],
                "responses": [
                  "A canyoning trip in Sundarijal usually lasts about 3 to 4 hours, depending on the operator and the specific package you choose. Some full-day canyoning tours may last up to 6 hours, including breaks for rest and meals. Be sure to confirm the duration when booking your trip."
                ]
              },
              {
                "intent": "ask_about_physical_requirements_for_canyoning_in_sundarijal",
                "examples": [
                  "Is canyoning in Sundarijal physically demanding?",
                  "Do I need to be fit for canyoning in Sundarijal?",
                  "Are there any fitness requirements for canyoning in Sundarijal?"
                ],
                "responses": [
                  "Canyoning in Sundarijal requires a moderate level of physical fitness. The activity involves walking on uneven and slippery terrain, rappelling down waterfalls, jumping into pools of water, and sometimes climbing or sliding over rocks. While it’s not an extreme sport, participants should be comfortable with water and heights. If you're unsure about your fitness level, it’s a good idea to consult with the operator before booking."
                ]
              }
            ]
          },
          {
            "intent": "food.and.water.in.hiking",
            "examples":[
                "can we buy food and water?",
                "food and water",
                "food", "water"
            ],
            "responses": [
                "No, there are no shops inside the climbing area. Bring your own food and water."
            ]
          }
          ]
}