{
    "intents": [
        {
            "intent": "greeting",
            "examples": [
                "Hi",
                "Hello",
                "Hey",
                "Good morning",
                "Good afternoon",
                "Good evening",
                "What's up"
            ],
            "responses": [
                "Hello! How can I assist you today?"
            ]
        },
        {
            "intent": "fallback",
            "examples": [
                "I don't understand",
                "What are you talking about?",
                "Can you explain that?",
                "I'm confused",
                "What does that mean?"
            ],
            "responses": [
                "I'm sorry, I didn't understand that. Can you rephrase?",
                "Could you please clarify?",
                "I'm not sure I follow. Can you provide more details?"
            ]
        },
        {
            "intent": "ask_how_are_you",
            "examples": [
                "How are you?",
                "How are you doing?",
                "Tell me about you"
            ],
            "responses": [
                "I'm just a bot, but I'm here to help you!"
            ]
        },
        {
            "intent": "ask_name",
            "examples": [
                "What's your name?",
                "Who are you?"
            ],
            "responses": [
                "I'm WanderMate, your virtual assistant."
            ]
        },
        {
            "intent": "ask_capabilities",
            "examples": [
                "What can you do?",
                "What help can you provide?",
                "Can you help me?"
            ],
            "responses": [
                "I can help answer your questions or provide information on various topics."
            ]
        },
        {
            "intent": "thank",
            "examples": [
                "Thank you",
                "Thanks",
                "tysm",
                "ty"
            ],
            "responses": [
                "You're welcome! If you have any more questions, feel free to ask."
            ]
        },
        {
            "intent": "farewell",
            "examples": [
                "Bye",
                "See you later",
                "ttyl",
                "byebye",
                "see you"
            ],
            "responses": [
                "Goodbye! Have a great day!"
            ]
        },
        {
            "intent": "introduce_kathmandu",
            "examples": [
                "Tell me about Kathmandu",
                "What is Kathmandu?",
                "Give me some information about Kathmandu",
                "What is Kathmandu known for?"
            ],
            "responses": [
                "Kathmandu is the capital and largest city of Nepal, located in the Kathmandu Valley in the central part of the country. It's known for its rich history, diverse culture, and vibrant traditions. Kathmandu is also the gateway to the Himalayas, attracting tourists from all over the world."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.history",
                    "examples": [
                        "Tell me about the history of Kathmandu",
                        "What is the history of Kathmandu?",
                        "When was Kathmandu founded?"
                    ],
                    "responses": [
                        "Kathmandu has been the political and cultural heart of Nepal for centuries. It was historically a key center of trade and culture in the region, and it has served as the capital of various kingdoms. The city’s history dates back over 2,000 years and includes a rich blend of Hindu and Buddhist cultures."
                    ]
                },
                {
                    "intent": "kathmandu.climate",
                    "examples": [
                        "What is the climate like in Kathmandu?",
                        "Tell me about the weather in Kathmandu",
                        "What is the best time to visit Kathmandu?"
                    ],
                    "responses": [
                        "Kathmandu has a temperate climate, with four distinct seasons: spring, summer, autumn, and winter. Summers (June–August) are warm and humid, with monsoon rains. Winters (December–February) are mild and dry, making it a great time to visit for sightseeing. The best time to visit Kathmandu is from October to April when the weather is pleasant and clear."
                    ]
                },
                {
                    "intent": "kathmandu.culture",
                    "examples": [
                        "Tell me about Kathmandu's culture",
                        "What are the cultural traditions in Kathmandu?",
                        "What is Kathmandu known for culturally?"
                    ],
                    "responses": [
                        "Kathmandu is a melting pot of diverse cultures, with both Hindu and Buddhist influences. The city celebrates many festivals like Dashain, Tihar, and Teej. Kathmandu is also famous for its traditional music, art, and dance. The Newar people, the indigenous inhabitants of the Kathmandu Valley, have their own unique traditions and cultural practices."
                    ]
                },
                {
                    "intent": "kathmandu.attractions",
                    "examples": [
                        "What are the top attractions in Kathmandu?",
                        "What should I visit in Kathmandu?",
                        "Tell me about the best places to see in Kathmandu"
                    ],
                    "responses": [
                        "Kathmandu is home to many must-see attractions like Swayambhunath Stupa (Monkey Temple), Pashupatinath Temple, Boudhanath Stupa, and Durbar Square."
                    ]
                },
                {
                    "intent": "kathmandu.food",
                    "examples": [
                        "What is the food like in Kathmandu?",
                        "Tell me about the cuisine in Kathmandu",
                        "What should I eat in Kathmandu?"
                    ],
                    "responses": [
                        "Kathmandu is famous for its variety of traditional Nepali food, including dishes like momos (dumplings), dal bhat (lentil soup with rice), and sel roti (a traditional doughnut-like rice cake). The city has a vibrant food scene with influences from Tibetan, Indian, and Newar cuisines."
                    ]
                },
                {
                    "intent": "kathmandu.more",
                    "examples": [
                        "Tell me more",
                        "Give me more details",
                        "I want more information",
                        "more"
                    ],
                    "responses": [
                        "Can you specify which topic you'd like more information about? Would you like to know more about Kathmandu’s history, culture, food, or attractions?"
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu.history",
            "examples": [
                "Tell me about the history of Kathmandu",
                "What is the history of Kathmandu?",
                "When was Kathmandu founded?"
            ],
            "responses": [
                "Kathmandu has been the political and cultural heart of Nepal for centuries. It was historically a key center of trade and culture in the region, and it has served as the capital of various kingdoms. The city’s history dates back over 2,000 years and includes a rich blend of Hindu and Buddhist cultures."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.history.more",
                    "examples": [
                        "Tell me more about the history",
                        "Give me more details",
                        "more"
                    ],
                    "responses": [
                        "Kathmandu's history is deeply intertwined with the Malla and Shah dynasties. The city was a major hub for trade between India and Tibet, and it played a significant role in the spread of Buddhism and Hinduism in the region."
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu.climate",
            "examples": [
                "What is the climate like in Kathmandu?",
                "Tell me about the weather in Kathmandu",
                "What is the best time to visit Kathmandu?"
            ],
            "responses": [
                "Kathmandu has a temperate climate, with four distinct seasons: spring, summer, autumn, and winter. Summers (June–August) are warm and humid, with monsoon rains. Winters (December–February) are mild and dry, making it a great time to visit for sightseeing. The best time to visit Kathmandu is from October to April when the weather is pleasant and clear."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.climate.more",
                    "examples": [
                        "Tell me more about the climate",
                        "Give me more details",
                        "more"
                    ],
                    "responses": [
                        "The monsoon season in Kathmandu (June to September) brings heavy rainfall, which can make travel difficult. However, the lush greenery during this time is breathtaking. Spring (March to May) is another great time to visit, with mild temperatures and blooming flowers."
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu.culture",
            "examples": [
                "Tell me about Kathmandu's culture",
                "What are the cultural traditions in Kathmandu?",
                "What is Kathmandu known for culturally?"
            ],
            "responses": [
                "Kathmandu is a melting pot of diverse cultures, with both Hindu and Buddhist influences. The city celebrates many festivals like Dashain, Tihar, and Teej. Kathmandu is also famous for its traditional music, art, and dance. The Newar people, the indigenous inhabitants of the Kathmandu Valley, have their own unique traditions and cultural practices."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.culture.more",
                    "examples": [
                        "Tell me more about the culture",
                        "Give me more details",
                        "more"
                    ],
                    "responses": [
                        "The Newar community is known for its intricate wood carvings, metalwork, and pottery. Kathmandu is also home to many UNESCO World Heritage Sites, which reflect the city's rich cultural heritage."
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu.attractions",
            "examples": [
                "What are the top attractions in Kathmandu?",
                "What should I visit in Kathmandu?",
                "Tell me about the best places to see in Kathmandu"
            ],
            "responses": [
                "Kathmandu is home to many must-see attractions like Swayambhunath Stupa (Monkey Temple), Pashupatinath Temple, Boudhanath Stupa, and Durbar Square."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.attractions.more",
                    "examples": [
                        "Tell me more about the attractions",
                        "Give me more details",
                        "more"
                    ],
                    "responses": [
                        "Swayambhunath Stupa, also known as the Monkey Temple, offers panoramic views of the city. Pashupatinath Temple is one of the holiest Hindu temples in the world, and Boudhanath Stupa is a major pilgrimage site for Tibetan Buddhists."
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu.food",
            "examples": [
                "What is the food like in Kathmandu?",
                "Tell me about the cuisine in Kathmandu",
                "What should I eat in Kathmandu?"
            ],
            "responses": [
                "Kathmandu is famous for its variety of traditional Nepali food, including dishes like momos (dumplings), dal bhat (lentil soup with rice), and sel roti (a traditional doughnut-like rice cake). The city has a vibrant food scene with influences from Tibetan, Indian, and Newar cuisines."
            ],
            "follow_up_questions": [
                {
                    "intent": "kathmandu.food.more",
                    "examples": [
                        "Tell me more about the food",
                        "Give me more details",
                        "more"
                    ],
                    "responses": [
                        "Momos are a must-try in Kathmandu. They are steamed or fried dumplings filled with meat or vegetables, served with a spicy dipping sauce. Dal bhat is a staple dish, consisting of lentil soup, rice, and vegetables, often served with pickles and yogurt."
                    ]
                }
            ]
        },
        {
            "intent": "world_heritage_sites_kathmandu",
            "examples": [
                "What are the World Heritage Sites in Kathmandu?",
                "Tell me about Kathmandu's UNESCO World Heritage Sites",
                "Which UNESCO sites are located in Kathmandu?"
            ],
            "responses": [
                "Kathmandu is home to several UNESCO World Heritage Sites, including:\n\n1. **Kathmandu Durbar Square**: A historic royal palace complex located in the heart of Kathmandu. It includes the **Hanuman Dhoka Palace**, **Kumari Ghar** (the residence of the living goddess), and **Kasthamandap** (a wooden pavilion). The square is culturally significant, serving as the political and cultural heart of the city for centuries.\n\n2. **Swayambhunath Stupa (Monkey Temple)**: A sacred Buddhist site with panoramic views of the city. It features a large stupa with the eyes of Buddha and is surrounded by shrines, statues, and numerous monkeys. The site is a spiritual retreat and a significant landmark for both Buddhists and Hindus.\n\n3. **Boudhanath Stupa**: One of the largest Buddhist stupas in the world, located in the northeastern part of Kathmandu. It has a large white dome and gold spire, surrounded by monasteries, prayer wheels, and Tibetan shops. It is an important center for Tibetan Buddhism and a major pilgrimage site.\n\n4. **Pashupatinath Temple**: A revered Hindu temple complex dedicated to Lord Shiva, located on the banks of the Bagmati River. It includes cremation ghats and is considered one of the holiest Hindu sites. The main temple, a pagoda-style structure, houses the sacred Pashupatinath idol.\n\n5. **Bhaktapur Durbar Square**: Located in Bhaktapur, just outside Kathmandu, this square features medieval architecture and historical buildings, including the **Vatsala Temple**, **55-Window Palace**, and the **Bhairab Nath Temple**. It showcases the cultural richness of the Malla period.\n\n6. **Patan Durbar Square**: Situated in the city of Patan, this square is famous for its intricate temples, including the **Mahabouddha Temple** and the **Golden Temple**. The square reflects the artistry of the Malla kings and is known for its fine stonework and carvings.\n\n7. **Changu Narayan Temple**: Located in Bhaktapur, this Hindu temple dedicated to Lord Vishnu is believed to be the oldest Hindu temple still in use. It features ancient inscriptions, a pagoda-style architecture, and beautifully crafted woodwork, making it a significant site for historical and religious studies.\n\nEach of these sites holds great cultural, religious, and historical importance. They showcase the rich heritage of Nepal and are visited by people from around the world for both spiritual purposes and historical exploration."
            ]
        },
        {
            "intent": "hiking_spots_kathmandu",
            "examples": [
                "What are the best hiking spots near Kathmandu?",
                "Where can I hike around Kathmandu?",
                "Suggest some hiking destinations near Kathmandu"
            ],
            "responses": [
                "Kathmandu offers access to stunning hiking trails. Popular hiking spots near the city include: \n1. **Nagarkot** – Known for sunrise views over the Himalayas. \n2. **Shivapuri National Park** – A serene forested area with trails leading to Shivapuri Peak. \n3. **Phulchowki** – The highest hill around the valley, offering beautiful views and diverse flora. \n4. **Chandragiri Hills** – Accessible by both cable car and hiking, with breathtaking views of the Kathmandu Valley and surrounding peaks. \nThese spots are ideal for nature lovers and adventurers."
            ]
        },
        {
            "intent": "about_bhaktapur",
            "examples": [
                "Tell me about Bhaktapur",
                "What is Bhaktapur?",
                "Give me some information about Bhaktapur",
                "What are the key attractions in Bhaktapur?",
                "Describe Bhaktapur"
            ],
            "responses": [
                "Bhaktapur is a historic city in the Kathmandu Valley, known for its well-preserved medieval architecture and rich cultural heritage. It is home to Bhaktapur Durbar Square, a UNESCO World Heritage Site."
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "Bhaktapur"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "ask_about_Bhaktapur_durbar_square",
                    "examples": [
                        "Tell me about Bhaktapur Durbar Square.",
                        "What can I see in Bhaktapur Durbar Square?",
                        "Describe Bhaktapur Durbar Square.",
                        "bhaktapur durbar square"
                    ],
                    "responses": [
                        "**Bhaktapur Durbar Square** is one of the most iconic and well-preserved historic sites in the Kathmandu Valley, located in Bhaktapur, just a few kilometers from Kathmandu. The square is a UNESCO World Heritage Site, celebrated for its stunning architecture and cultural significance. The square was once the royal palace complex of the Malla kings, serving as the political and cultural center of the city for centuries."
                    ]
                },
                {
                    "intent": "Bhaktapur_architecture",
                    "examples": [
                        "How does Bhaktapur Durbar Square reflect Newari architecture?",
                        "bhaktapur architecture",
                        "architecture"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square reflects Newari architecture through its intricate woodwork, fine carvings, and pagoda-style roofs."
                    ],
                    "more": [
                        "Wooden Carvings: Newari architecture is known for its intricate woodcarvings. In Bhaktapur, you'll find wooden windows, doors, struts, and beams adorned with detailed motifs and figures from Hindu and Buddhist mythology.",
                        "Pagoda-Style Temples: Pagoda-style architecture is a hallmark of Newari temple design."
                    ]
                },
                {
                    "intent": "ask_about_Bhaktapur_palace",
                    "examples": [
                        "What is the purpose of the 55-Window Palace?",
                        "55 window palace",
                        "55 jhyale"
                    ],
                    "responses": [
                        "The 55-Window Palace was the royal residence during the Malla kings' reign and remains an architectural landmark in Bhaktapur. It is famous for its intricately carved wooden windows and doors, which are significant examples of Newari craftsmanship."
                    ],
                    "more": [
                        "One of the most stunning buildings in the durbar square is the Palace with Fifty-Five Windows. This palace was built by King Bhupatindra Malla in 1677. The Palace of 55 (Fifty-Five) Windows got its name from the façade's fifty-five intricately carved wooden windows. This palace is constructed around a number of interconnected interior courtyards. According to legend, there were initially 99 courtyards, but currently there are just nine. The 'Golden Gate' main entrance gate is another outstanding feature of this palace. In the early eighteenth century, King Jayastithi Malla later erected this gate to the palace. Metal embossed with gold plating is used to embellish this gate. It leads to the palace's entrance courtyard."
                    ]
                },
                {
                    "intent": "ask_about_Bhaktapur_festivals",
                    "examples": [
                        "How do traditional festivals impact Bhaktapur Durbar Square?"
                    ],
                    "responses": [
                        "Traditional festivals, such as Bisket Jatra, bring the community together and help preserve the cultural heritage of Bhaktapur Durbar Square."
                    ]
                },
                {
                    "intent": "ask_about_vatsala_temple",
                    "examples": [
                        "What is the architectural style of the Vatsala Temple?",
                        "vatsala temple",
                        "temples in bhaktapur"
                    ],
                    "responses": [
                        "The Vatsala Temple showcases traditional Newari architecture with its finely crafted wooden windows and intricate carvings."
                    ],
                    "more": [
                        "The Vatsala Durga (also known as the Vatsala Devi) is located on the east side of the Bhaktapur Darbar Square. It is a sikhara-style monument dedicated to the Vatsala manifestation of the female deity Durga. The temple was the third Vatsala temple constructed in Bhaktapur's Darbar Square, following two earlier temples constructed by King Jitamitra Malla (r. 1663-96). The first temple is a miniature shrine located behind the Pashupatinath temple; the second was constructed behind the Siddhi Lakshmi temple but was destroyed in the 1934 earthquake. The third temple, shown in this series of images, was likely built late in the 1690s, but the precise date is unknown. The only date that can be fixed is the replacement of the temple's bell in 1721, suggesting that the temple had already existed long enough for the original bell to require replacement."
                    ]
                },
                {
                    "intent": "ask_about_bhairavnath_temple",
                    "examples": [
                        "What is the significance of the Bhairavnath Temple?",
                        "bhairavnath",
                        "bhairavnath temple"
                    ],
                    "responses": [
                        "The Bhairavnath Temple is dedicated to Lord Bhairav, one of the fiercest deities in Hinduism, and is an important religious site in Bhaktapur."
                    ],
                    "more": [
                        "Bhairavanath temple is one sacred temple of Bhaktapur that lies at the central square of Bhaktapur, Taumadhi Square. This temple devoted to lord bhairava is one of the rectangular based temples of Bhaktapur. One could easily recognize this temple as it lies right behind the giant Nyatapola temple."
                    ]
                },
                {
                    "intent": "ask_about_nyatapola_temple",
                    "examples": [
                        "What makes the Nyatapola Temple unique?",
                        "nyatapola temple",
                        "nyatpola temple"
                    ],
                    "responses": [
                        "The Nyatapola Temple is the tallest pagoda-style temple in Nepal and is famous for its five tiers and impressive architecture."
                    ],
                    "more": [
                        "Nyatapola is a five-storeyed ancient temple that makes each Bhaktapurians feel so proud. People may have very little knowledge about Bhaktapur city. But, within that tatter of knowledge, they put a page where the mysterious stories of Nyatapola always breathe. Explaining its accessories. There are 5 Ganesha, 5 tiers, 5 plinths, 33 steps, 108 struts, and 360 battens used in the temple. Whereas, all these numbers have a significant role in tantrism."
                    ]
                },
                {
                    "intent": "ask_about_peacock_window",
                    "examples": [
                        "What is the story behind the Peacock Window?",
                        "peacock window"
                    ],
                    "responses": [
                        "The Peacock Window is an intricately carved wooden window that symbolizes the artistic excellence of Newari craftsmanship in Bhaktapur."
                    ]
                },
                {
                    "intent": "ask_about_preservation",
                    "examples": [
                        "What efforts are being made to preserve Bhaktapur Durbar Square?"
                    ],
                    "responses": [
                        "Restoration projects, funded by both local and international organizations, are ongoing to repair the structures damaged by time and disasters."
                    ]
                },
                {
                    "intent": "ask_about_earthquake_impact",
                    "examples": [
                        "How did the 2015 earthquake impact Bhaktapur Durbar Square?"
                    ],
                    "responses": [
                        "The 2015 earthquake caused significant damage to several structures in Bhaktapur Durbar Square, including temples, shrines, and monuments."
                    ]
                },
                {
                    "intent": "ask_about_pottery_square",
                    "examples": [
                        "What is Pottery Square famous for?"
                    ],
                    "responses": [
                        "Pottery Square is renowned for its traditional pottery-making, where artisans create various clay products that are sold to locals and tourists."
                    ],
                    "more": [
                        "Pottery Square in Bhaktapur, Nepal, is a vibrant hub of culture, craft, and creativity. It’s a place where the traditional art of pottery is still alive and thriving, with local artisans shaping clay into various forms, from pots and vases to intricate sculptures."
                    ]
                },
                {
                    "intent": "ask_about_lions_gate",
                    "examples": [
                        "What is the significance of the Lion's Gate?",
                        "lions gate",
                        "lion gate"
                    ],
                    "responses": [
                        "The Lion's Gate is a historical entrance to Bhaktapur Durbar Square, known for its detailed sculptures of lions that protect the entrance.The Lion Gate is a 17th-century structure, created with the belief that it will protect the ancient city. The gate has two large and majestic lion statues placed on either side. The Lion Gate is located inside the Bhaktapur Durbar Square along with several other ancient buildings and artefacts, which is accessible through many well-maintained pathways. Popular belief holds the King to have chopped off the hands of the artisans who built the Lion Gate, an attempt to ensure that to Lion Gate would never be replicated."
                    ]
                },
                {
                    "intent": "ask_about_newari_culture",
                    "examples": [
                        "How is Newari culture preserved in Bhaktapur?",
                        "newari culture",
                        "culture in bhaktapur",
                        "bhaktapur culture"
                    ],
                    "responses": [
                        "Newari culture is preserved in Bhaktapur through the maintenance of historical buildings, traditional crafts, and cultural practices."
                    ],
                    "more": [
                        "Bhaktapur is a “Living Heritage” or “Living Museum” displaying the vibrant depth of Newari culture. Great festivals of local Newars, their life style, rituals, Daffas (prayers group) and Guthis and traditional dance groups are giving life to the intangible heritage of the city."
                    ]
                },
                {
                    "intent": "bhaktapur_famous",
                    "examples": [
                        "What is bhaktapur famous for?",
                        "bhaktapur popularity",
                        "famous bhaktapur"
                    ],
                    "responses": [
                        "Bhaktapur is also famous for its cuisine with the jūjū dhau, a type of yogurt made from buffalo milk being the most popular. Bhaktapur's potters and handicraft industries are also known nationwide."
                    ]
                },
                {
                    "intent": "ask_about_siddhi_laxmi_temple",
                    "examples": [
                        "What is the history behind the Siddhi Laxmi Temple?",
                        "siddhi laxmi temple",
                        "laxmi temple",
                        "siddhi"
                    ],
                    "responses": [
                        "The Siddhi Laxmi Temple dates back to the Malla period and is an important site for religious worship dedicated to the goddess Laxmi."
                    ],
                    "more": [
                        "Siddhi Laxmi temple of Bhaktapur Durbar Square is also called Lohan Dega, the stone temple. It was first positioned by King Jagat Prakash Malla on the southeast side of 55 windowed palaces."
                    ]
                },
                {
                    "intent": "ask_about_taleju_bhawani_temple",
                    "examples": [
                        "What is the significance of the Taleju Bhawani Temple?",
                        "taleju bhawani",
                        "taleju"
                    ],
                    "responses": [
                        "The Taleju Bhawani Temple is dedicated to the goddess Taleju, a protector deity worshipped by the Malla kings, and is an important religious site."
                    ],
                    "more": [
                        "Taleju Bhawani is one of the most powerful goddess and her temple stands out among the many temples and monuments around Durbar Square. Legend has it that she played Tripasa (a dice game) with the last Malla king Jayaprakash Malla every night."
                    ]
                },
                {
                    "intent": "ask_about_identity_and_heritage",
                    "examples": [
                        "How does Bhaktapur Durbar Square contribute to Nepal's identity?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square contributes to Nepal's identity by preserving its rich cultural heritage, architecture, and religious significance."
                    ]
                },
                {
                    "intent": "ask_about_local_artisans_contribution",
                    "examples": [
                        "How do local artisans contribute to Bhaktapur Durbar Square?",
                        "local art"
                    ],
                    "responses": [
                        "Local artisans contribute by practicing traditional crafts such as wood carving, pottery, and metalwork, which help maintain the cultural heritage of Bhaktapur."
                    ]
                },
                {
                    "intent": "ask_about_economy_through_tourism",
                    "examples": [
                        "How does Bhaktapur Durbar Square support the local economy?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square supports the local economy by attracting tourists who contribute to the economy through entrance fees, local crafts, and guided tours."
                    ]
                },
                {
                    "intent": "ask_about_cultural_exchange",
                    "examples": [
                        "How does Bhaktapur Durbar Square promote cultural exchange?"
                    ],
                    "responses": [
                        "Bhaktapur Durbar Square promotes cultural exchange through its festivals, events, and educational programs that showcase Nepal's rich cultural heritage."
                    ]
                },
                {
                    "intent": "more",
                    "examples": [
                        "Tell me more about Bhaktapur",
                        "Give me more information",
                        "What else can you tell me about Bhaktapur?",
                        "more"
                    ],
                    "responses": [
                        "Bhaktapur, an anciently choreographed city, moreover, is also designated as an open museum. Over hereabouts, you can catch sight of the marvelous erections up until the last 18th century.  Amidst them, the then Royal Palace is one of the most attractive temptations of Bhaktapur Durbar Square. It is said that the first palace in the current Durbar area was built by King Jayasthiti Malla, in the late 13th century."
                    ]
                }
            ]
        },
        {
            "intent": "kathmandu_durbar_square",
            "examples": [
                "What is Kathmandu Durbar Square?",
                "Where is Kathmandu Durbar Square located?",
                "Why is Kathmandu Durbar Square important?",
                "kathmandu durvar square",
                "ktm durbar square",
                "basantapur"
            ],
            "responses": [
                "Kathmandu Durbar Square (Basantapur) is a historic site in the heart of Kathmandu, known for its palaces, temples, and courtyards. It is located in central Kathmandu, near the Thamel area. It was the royal palace of the Malla kings and later the Shah dynasty, serving as the center of administration and culture."
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "Basantapur"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "historical_and_cultural_significance",
                    "examples": [
                        "What is the historical significance of Kathmandu Durbar Square?",
                        "Which festivals are celebrated at Kathmandu Durbar Square?",
                        "What are some of the key landmarks in Kathmandu Durbar Square, and their founding dates?",
                        "What is known about the establishment of Kathmandu Durbar Square?",
                        "history and culture"
                    ],
                    "responses": [
                        "It was the royal palace of the Malla kings and later the Shah dynasty, serving as the center of administration and culture. Major festivals include Indra Jatra, Dashain, and Kumari Jatra. The First Royal Palace: 11th century by Shankaradev\nKasthamandap Temple: 12th century by Laxmi Nar Singh Malla, renovated in the 16th century\nTaleju Temple: 1564 by Ratna Malla\nHanuman Dhoka Palace: 17th century, constructed by multiple kings of the Lichhavi and Shah dynasties\nNautale Durbar (Basantapur Durbar): 1770 by Prithvi Narayan Shah\nKumari Ghar: 1757 by Jaya Prakash Malla."
                    ]
                },
                {
                    "intent": "architecture",
                    "examples": [
                        "What are the main architectural highlights of Kathmandu Durbar Square?",
                        "Can you tell me about the Hanuman Dhoka Palace?",
                        "What is the significance of the Kal Bhairav statue?"
                    ],
                    "responses": [
                        "Key highlights include the Hanuman Dhoka Palace, Taleju Temple, and the statue of Kal Bhairav.",
                        "The Hanuman Dhoka Palace is an ancient palace complex that served as the royal residence and administrative center.",
                        "The Taleju Temple is a three-story temple dedicated to the goddess Taleju, built in 1564.",
                        "The statue of Kal Bhairav is a massive stone image of the fearsome aspect of Lord Shiva, believed to be a protector."
                    ]
                },
                {
                    "intent": "visitor_information",
                    "examples": [
                        "What are the opening hours of Kathmandu Durbar Square?",
                        "opening hours",
                        "How much is the entry fee for Kathmandu Durbar Square?",
                        "entry fee",
                        "Is Kathmandu Durbar Square accessible for disabled visitors?"
                    ],
                    "responses": [
                        "The square is open from early morning until evening, though specific timings can vary.Entry fees vary for locals and foreigners, with discounts for SAARC nationals.",
                        "The square has some areas that are accessible for disabled visitors, but certain historical structures may have limited accessibility."
                    ]
                },
                {
                    "intent": "faqs",
                    "examples": [
                        "How can I get to Kathmandu Durbar Square?",
                        "What other attractions are near Kathmandu Durbar Square?",
                        "Is Kathmandu Durbar Square safe for tourists?",
                        "What is the best time to visit Kathmandu Durbar Square?"
                    ],
                    "responses": [
                        "You can reach the square by taxi, rickshaw, or on foot from central Kathmandu areas like Thamel.",
                        "Nearby attractions include Swayambhunath (Monkey Temple), Garden of Dreams, and Thamel.",
                        "Kathmandu Durbar Square is generally safe for tourists, but it's always good to be cautious and aware of your surroundings.",
                        "The best time to visit is during the autumn (September to November) and spring (March to May) seasons when the weather is pleasant."
                    ]
                },
                {
                    "intent": "trivia_and_fun_facts",
                    "examples": [
                        "What is a fun fact about Kathmandu Durbar Square?",
                        "Are there any legends associated with Kathmandu Durbar Square?",
                        "What are some lesser-known facts about Kathmandu Durbar Square?",
                        "What unique traditions are associated with Kathmandu Durbar Square?"
                    ],
                    "responses": [
                        "The square has a unique tradition of the living goddess Kumari, who is chosen from the Newar community and worshipped until she reaches puberty.",
                        "One popular legend is about the construction of the Kasthamandap temple, believed to be built from the wood of a single tree.",
                        "The square was the site of the coronation of many kings of Nepal, including King Birendra and King Gyanendra.",
                        "During Indra Jatra, the living goddess Kumari is taken around the city in a chariot procession, attracting large crowds of devotees."
                    ]
                },
                {
                    "intent": "tips_for_visitors",
                    "examples": [
                        "What safety tips should visitors keep in mind?",
                        "What cultural etiquette should visitors follow?",
                        "What type of footwear is recommended for visiting Kathmandu Durbar Square?",
                        "How should visitors respect the local culture at Kathmandu Durbar Square?"
                    ],
                    "responses": [
                        "Visitors should be mindful of their belongings, especially during crowded festivals.Visitors should respect local customs and traditions, and dress modestly when visiting temples. Wear comfortable shoes, as the square is a large area with many landmarks and attractions to explore, ensuring you can walk around comfortably. Visitors should dress modestly, remove their shoes before entering temples or other religious sites, and behave respectfully towards others."
                    ]
                },
                {
                    "intent": "how_to_reach_kathmandu_durbar_square",
                    "examples": [
                        "How accessible is Kathmandu Durbar Square from various parts of the city?",
                        "Can you walk to Kathmandu Durbar Square from Thamel?",
                        "How can you reach Kathmandu Durbar Square by car or taxi?",
                        "What public transportation options are available to reach Kathmandu Durbar Square?",
                        "Is it possible to reach Kathmandu Durbar Square by bicycle?"
                    ],
                    "responses": [
                        "The square is easily accessible from many parts of the city and can be reached by various transportation options.",
                        "Yes, if you are staying in the Thamel area, you can easily walk to the square. It is within walking distance (10-20 minutes) from many popular tourist areas, such as Thamel, Asan Tole, and New Road.",
                        "You can hire a car or taxi from your hotel, guesthouse, or one of the many car rental agencies in the city. Vehicles are not allowed inside the square area, so you'll be dropped at one of the many entrances.",
                        "Public transportation is readily available in the city and is a cheap and convenient way to get around. Several bus stops and pickup points are located near the square, such as RNAC, Ratnapark, Lainchaur, and Sahid Gate. You can take a bus or microbus to get there.",
                        "Yes, you can rent a bike or bring your own and ride to the square. Unlike vehicles, bicycles are allowed inside the square. You can also join a guided bike tour to visit the square and other popular attractions in the city."
                    ]
                }
            ]
        },
        {
            "intent": "about_pashupatinath",
            "examples": [
                "Tell me about Pashupatinath",
                "What is Pashupatinath?",
                "Give me some information about Pashupatinath",
                " Pashupatinath"
            ],
            "responses": [
                "The Pashupatinath Temple (Nepali: पशुपतिनाथ मन्दिर) is a Hindu temple dedicated to Pashupati, a form of Shiva. It is located in Kathmandu, Nepal, on the bank of the Bagmati River. The temple was classified as a World Heritage Site in 1979. This 'extensive Hindu temple precinct' is a 'sprawling collection of temples, ashrams, images and inscriptions raised over the centuries along the banks of the sacred Bagmati river', and is one of seven monument groups in UNESCO's designation of Kathmandu Valley."
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "Pashupatinath"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "ask_about_location",
                    "examples": [
                        "Where is Pashupatinath located?",
                        "Can you tell me the location of Pashupatinath?",
                        "location"
                    ],
                    "responses": [
                        "Pashupatinath Temple is located in Kathmandu, Nepal, on the banks of the Bagmati River. Address: Pashupati Nath Road, Kathmandu 44600. Go to maps for better location"
                    ]
                },
                {
                    "intent": "ask_about_deity",
                    "examples": [
                        "Which deity is worshipped at Pashupatinath?",
                        "Who is the main deity of Pashupatinath?",
                        "main deity",
                        "main god",
                        "which god"
                    ],
                    "responses": [
                        "Pashupatinath Temple is dedicated to Lord Shiva, one of the principal deities in Hinduism."
                    ],
                    "more": [
                        "The sacro sanctum, or the main idol, is a stone Mukhalinga with a silver yoni base bound with a silver serpent. It is one metre high and has faces in four directions, which represent various aspects of Shiva; Sadyojata (also known as Barun), Vamadeva (also known as Ardhanareshwara), Tatpurusha, Aghora, and Ishana (imaginative). Each face has tiny protruding hands holding rudraksha mala in the right hand and a kamandalu in the other. Unlike other Shiva lingams in India and Nepal, this lingam is always dressed in its golden vastram except during abhisheka, so pouring milk and Ganga Jal is only possible during the ritual through the main priests."
                    ]
                },
                {
                    "intent": "ask_about_architecture",
                    "examples": [
                        "What is the architecture of Pashupatinath?",
                        "Can you describe the architecture of Pashupatinath?",
                        " Pashupatinath architecture",
                        "architecture"
                    ],
                    "responses": [
                        "This main temple is built in Newari architecture. The two-level roofs are of copper with gold covering. The temple rests on a square base platform with a height of 23m 7 cm from base to pinnacle. It has four main doors, all covered with silver sheets. This temple has a gold pinnacle (peak). Inside are two garbhagrihas: the inner garbhagriha or sanctum sanctorum is where the idol is placed, and the outer sanctum is an open corridor-like space."
                    ]
                },
                {
                    "intent": "ask_about_festivals",
                    "examples": [
                        "What festivals are celebrated at Pashupatinath?",
                        "Which is the main festival at Pashupatinath?",
                        "festivals"
                    ],
                    "responses": [
                        "The main festival celebrated at Pashupatinath is Maha Shivaratri, which attracts thousands of devotees. Teej is also one of the most celebrated festivals in Nepal. Teej is celebrated in Pashupatinath temple and the shiva's temple. In this festival, most of the girls and women celebrate by singing and dancing on a song that is dedicated to shiva."
                    ]
                },
                {
                    "intent": "ask_about_rules",
                    "examples": [
                        "Who can enter the inner sanctum of Pashupatinath?",
                        "Are non-Hindus allowed inside Pashupatinath?",
                        "hindus in pashupatinath",
                        "muslims",
                        "christains",
                        "religions"
                    ],
                    "responses": [
                        "Only Hindus are allowed inside the inner sanctum of Pashupatinath Temple. Non-Hindus can view the temple from the outside."
                    ]
                },
                {
                    "intent": "ask_about_history",
                    "examples": [
                        "What is the history of Pashupatinath?",
                        "When was Pashupatinath built?"
                    ],
                    "responses": [
                        "Pashupatinath Temple dates back to the 5th century and is one of the oldest Hindu temples in Nepal. It was designated a UNESCO World Heritage Site in 1979."
                    ],
                    "more": [
                        "Pashupatinath Temple is the oldest Hindu temple in Kathmandu. The temple is considered to be pre-Vedic in its origin and according to Nepal Mahatmaya and Himvatkhanda of Skanda Purana, the deity here gained great fame as Pashupati. As per Shiva Purana, the linga of Pashupatinath that lies in Nepal has the capacity to fulfill all desires, and the story of Pashupatinath is narrated along with the greatness of Kedareshwara (Kedarnath) in the 9th chapter of 'Koti-Rudra Samhita' which describes the journey of Pandavas in the search of Shiva. After Pandavas perform much penance, Shiva who had hidden himself underground in the form of a bull, reappears with his head in Pashupatinath, hump in Kedarnath, face in Rudranath, arms in Tungnath and navel in Madhyamaheshwar. One legend says that Shiva and Parvati took the form of antelopes in the forest on the Bagmati river's east bank. The gods later caught up with him and grabbed him by one of his horns, forcing him to resume his divine form. The broken horn was worshipped as a linga, but over time it was buried and lost. Centuries later a herdsman found one of his cows showering the earth with milk, and after digging at the site, he discovered the divine linga of Pashupatinath. Pashupatinath Temple's existence is recorded as early as 400 CE.[17] The ornamented pagoda houses the linga of Shiva. According to Gopalraj Aalok Vhat, the temple was built by Prachanda Deva, a Licchavi king. Another chronicle states that Pashupatinath Temple was in the form of Linga shaped Devalaya before Supuspa Deva constructed a five-storey temple of Pashupatinath in this place. As time passed, the temple needed to be repaired and renovated. It is known that this temple was reconstructed by a medieval king named Shivadeva (1099–1126 CE). It was renovated by Ananta Malla adding a roof to it.[18][19] Further temples have been erected around the two-storied temple, including the Vaishnava temple complex with a Rama temple from the 14th century and the Guhyeshwari Temple mentioned in an 11th-century manuscript, overtime. The current form of the temple was renovated in 1692 CE after the previous structures were affected by termites and earthquakes."
                    ]
                },
                {
                    "intent": "ask_about_rituals",
                    "examples": [
                        "What rituals are performed at Pashupatinath?",
                        "What is the Bhasm Aarti at Pashupatinath?",
                        "aarati",
                        "rituals"
                    ],
                    "responses": [
                        "Daily rituals at Pashupatinath include morning and evening prayers, abhishekam (ritual bath), and the Bhasm Aarti, a special fire ritual performed at dawn and dusk."
                    ]
                },
                {
                    "intent": "ask_about_significance",
                    "examples": [
                        "Why is Pashupatinath important?",
                        "What is the significance of Pashupatinath?",
                        "significance"
                    ],
                    "responses": [
                        "Pashupatinath is one of the holiest Shiva temples in the world and a UNESCO World Heritage Site. It is a major pilgrimage site for Hindus, especially during Maha Shivaratri."
                    ]
                }
            ]
        },
        {
            "intent": "about_boudhanath",
            "examples": [
                "Tell me about Boudhanath",
                "What is Boudhanath?",
                "Boudhanath",
                "boudha",
                "bouddha"
            ],
            "responses": [
                "Boudhanath Stupa is one of the largest stupas in the world and a UNESCO World Heritage Site. It is a significant pilgrimage site for Tibetan Buddhists.It is a stupa and major spiritual landmark seen as the embodiment of the enlightened mind of all the Buddhas [who follow the Buddhism religion]."
            ],
            "more": [
                "Bouddhanath Stupa, located in the eastern part of Kathmandu, Nepal, is one of the largest and most important Buddhist stupas in the world. Revered as a sacred site by Tibetan Buddhists, it is a focal point for both religious pilgrimage and cultural heritage. The stupa, with its large mandala and all-seeing eyes of Buddha painted on the tower, symbolizes the all-pervading awareness of the Buddha. \n Surrounded by a bustling area filled with monasteries, Tibetan shops, and cafes, Bouddhanath is a hub for Tibetan culture in Nepal. Visitors often walk around the stupa (kora), spinning prayer wheels and chanting mantras, as a form of devotion. The stupa is particularly important during festivals like Buddha Jayanti, when pilgrims and tourists gather for prayers, rituals, and celebrations.\n The area is also home to several Tibetan monasteries and gompas (temples), where monks lead prayers and meditation. Tibetan handicrafts, such as thangkas (traditional paintings), prayer flags, and jewelry, are sold in the local markets, adding to the rich cultural experience. Bouddhanath is an ideal place for those seeking spiritual reflection, meditation, and an immersion in Tibetan Buddhist culture, making it a must-visit for tourists interested in history, spirituality, and tradition. "
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "boudha"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "ask_about_location",
                    "examples": [
                        "Where is Boudhanath located?",
                        "Can you tell me the location of Boudhanath?",
                        "boudha location",
                        "location"
                    ],
                    "responses": [
                        "Boudhanath Stupa is locate in Boudhanath, within the city of Kathmandu, Nepal. Built in the northeast of Kathmandu Valley in a Tamang village surrounded by rice paddies,the stupa gave birth to the origins of Tibetan Buddhism."
                    ]
                },
                {
                    "intent": "ask_about_history",
                    "examples": [
                        "What is the history of Boudhanath?",
                        "When was Boudhanath built?",
                        "history"
                    ],
                    "responses": [
                        "Boudhanath Stupa dates back to the 14th century and is believed to have been built to enshrine the relics of the Buddha."
                    ],
                    "more": [
                        "An earlier written source Gopālarājavaṃśāvalī says Boudhanath itself was founded by the Nepalese Licchavi king Śivadeva (c. 590–604 CE); though other Nepalese chronicles date it to the reign of King Mānadeva (464–505 CE). The earliest historical references to the Khaasti Chaitya are found in the Chronicles of the Newars. First, Khaasti is mentioned as one of the four stupas found by the Licchavi king Vrisadeva (c. 400 CE) or Vikramjit. Second, the Newars legend of the stupa's origin attributes it to King Dharmadeva's son, Manadeva as atonement for his unwitting patricide. Manadeva was a great Licchavi king, military conqueror and a patron of the arts who reigned c. 464–505. Manadeva is also linked with the Swayambhu Chaitya of Gum Bahal. Third, another great Licchhavi king Shivadeva (AD 590–604) is associated with Boudha by an inscription; he may have restored the chaitya."
                    ]
                },
                {
                    "intent": "ask_about_architecture",
                    "examples": [
                        "What is the architecture of Boudhanath?",
                        "Can you describe the architecture of Boudhanath?",
                        "boudha architecture",
                        "architecture"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a massive mandala, designed to represent the universe. Its main feature is the all-seeing eyes of the Buddha."
                    ],
                    "more": [
                        "Mandala Shape: Standing tall and dominating the horizon, the Boudhanath Stupa is indeed one of the largest stupas in the world and the biggest in Nepal. Its magnificent structure is a visual representation of Lord Buddha’s path to enlightenment. The Stupa is designed in the shape of a mandala, which is a sacred geometric pattern that represents the universe and the interconnectedness of all things. The mandala shape of the Boudhanath stupa is intended to symbolize the totality of existence and the journey toward enlightenment. With each part symbolizing an essential element of Buddhism, Boudhanath Stupa is undoubtedly a magnificent site of peace and serenity. \n Base and Spires of the Stupa : At the base of the stupa, the Earth is represented. The Kumbha or white dome represents water, while the spire represents air, and the top umbrella form symbolizes the void. According to Buddhist belief, 13 phases are needed to attain Nirvana, and the 13 spires of the stupa represent these stages. Walking clockwise around the stupa, while keeping it to your right, is customary. Prayer wheels should also be spun in a clockwise direction. \n The Eyes of Buddha: The stupa's name is derived from the thirteen steps, which symbolize the Bodhisattva's basis for enlightenment or 'Bodhi' in its thirteen phases. The triangle at the top of the stupa represents fire. The four corners of the stupa’s central tower are adorned with massive pairs of eyes, which represent the Buddha's eyes of wisdom. The eyes of the stupa stand in for the Buddha's all-seeing ability. The nose of the stupa represents Nirvana and is also supposed to reflect the Nepali letter representing the number one, which stands for unity and the only path to enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_religion",
                    "examples": [
                        "Why is Boudhanath important in Buddhism?",
                        "What is the religious significance of Boudhanath?",
                        "religion",
                        "buddhism",
                        "buddhas",
                        "buddhist"
                    ],
                    "responses": [
                        "Boudhanath Stupa is one of the holiest Buddhist sites in Nepal. It is a center of Tibetan Buddhism and attracts pilgrims from all over the world. \n  Buddhism, founded by Siddhartha Gautama 'the Buddha' in the 6th century BCE, is a spiritual tradition centered around understanding and overcoming suffering. It teaches that suffering is an inherent part of life, caused by desire and attachment. \n The Buddha's teachings are encapsulated in the Four Noble Truths: (1) suffering exists, (2) it has a cause, (3) it can be ended, and (4) there is a path to its cessation, known as the Noble Eightfold Path. \n The Eightfold Path consists of ethical and mental practices, including right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration, all aiming to end suffering and achieve Nirvana, a state of liberation from the cycle of birth and rebirth (samsara). \n Buddhism emphasizes mindfulness, meditation, and ethical living. It teaches non-attachment, non-self (anatta), and impermanence (anicca). Major branches of Buddhism include Theravada, Mahayana, and Vajrayana, each with unique practices and interpretations of Buddhist teachings. Buddhism has greatly influenced the culture, art, and philosophy of many Asian countries and continues to offer practical guidance for reducing suffering and achieving peace."
                    ]
                },
                {
                    "intent": "ask_about_unesco_status",
                    "examples": [
                        "Is Boudhanath a UNESCO World Heritage Site?",
                        "When was Boudhanath designated as a UNESCO site?"
                    ],
                    "responses": [
                        "Yes, Boudhanath Stupa was designated a UNESCO World Heritage Site in 1979 due to its cultural and religious significance."
                    ]
                },
                {
                    "intent": "ask_about_pilgrimage",
                    "examples": [
                        "Why do people visit Boudhanath?",
                        "Is Boudhanath a pilgrimage site?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is an important pilgrimage site for Tibetan Buddhists. Devotees come to pray, make offerings, and perform circumambulations around the stupa."
                    ]
                },
                {
                    "intent": "ask_about_tourist_activities",
                    "examples": [
                        "What can I do at Boudhanath?",
                        "What activities are available for tourists at Boudhanath?",
                        "tourist activities"
                    ],
                    "responses": [
                        "Visitors can walk around the stupa, participate in circumambulation, observe rituals, visit nearby monasteries, and shop for Tibetan handicrafts."
                    ]
                },
                {
                    "intent": "ask_about_opening_hours",
                    "examples": [
                        "What are the opening hours of Boudhanath?",
                        "When is Boudhanath open?",
                        "opening hours"
                    ],
                    "responses": [
                        "Boudhanath Stupa is open every day, typically from 6:00 AM to 7:00 PM."
                    ]
                },
                {
                    "intent": "ask_about_entry_fee",
                    "examples": [
                        "Is there an entry fee for Boudhanath?",
                        "How much is the entry fee for Boudhanath?",
                        "entry fee"
                    ],
                    "responses": [
                        "Yes, the entry fee for foreign nationals is NPR 400, while Nepali citizens can visit for free."
                    ]
                },
                {
                    "intent": "ask_about_surrounding_area",
                    "examples": [
                        "What is there to see around Boudhanath?",
                        "What are the attractions near Boudhanath?"
                    ],
                    "responses": [
                        "There are many monasteries, stupas, and Tibetan shops around Boudhanath Stupa. Visitors can also explore nearby Buddhist temples and local markets."
                    ]
                },
                {
                    "intent": "ask_about_monasteries",
                    "examples": [
                        "What are the famous monasteries near Boudhanath?",
                        "Can you tell me about the monasteries near Boudhanath?"
                    ],
                    "responses": [
                        "Some of the well-known monasteries near Boudhanath include the Shechen Monastery, the Kagyu Monastery, and the Tibetan Buddhist Monastery."
                    ]
                },
                {
                    "intent": "ask_about_cultural_significance",
                    "examples": [
                        "What is the cultural significance of Boudhanath?",
                        "Why is Boudhanath culturally important?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a cultural hub for Tibetan Buddhism. It serves as a center for cultural exchange, religious practices, and Tibetan identity in Nepal."
                    ]
                },
                {
                    "intent": "ask_about_special_events",
                    "examples": [
                        "What festivals are celebrated at Boudhanath?",
                        "Are there any special events at Boudhanath?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a focal point for Tibetan Buddhist festivals, including Losar (Tibetan New Year), Buddha Jayanti, and the Monlam Prayer Festival."
                    ]
                },
                {
                    "intent": "ask_about_tibetans",
                    "examples": [
                        "Why are there so many Tibetans at Boudhanath?",
                        "What role do Tibetans play at Boudhanath?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is a prominent site for Tibetans in Nepal. It has a strong Tibetan community and is a spiritual and cultural hub for Tibetan refugees in Nepal."
                    ]
                },
                {
                    "intent": "ask_about_famous_items",
                    "examples": [
                        "What are the famous items sold near Boudhanath?",
                        "Can I buy Tibetan handicrafts at Boudhanath?",
                        "souvenirs",
                        "what to buy?"
                    ],
                    "responses": [
                        "Popular items include prayer wheels, thangka paintings, Tibetan jewelry, prayer flags, and traditional Tibetan clothing."
                    ]
                },
                {
                    "intent": "ask_about_transportation",
                    "examples": [
                        "How can I get to Boudhanath?",
                        "What is the best way to reach Boudhanath?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is easily accessible by taxi, rickshaw, or public transportation. It's about a 15-minute drive from the center of Kathmandu."
                    ]
                },
                {
                    "intent": "ask_about_best_time_to_visit",
                    "examples": [
                        "When is the best time to visit Boudhanath?",
                        "What is the best time of day to visit Boudhanath?",
                        "when to visit?"
                    ],
                    "responses": [
                        "The best time to visit Boudhanath Stupa is early in the morning for a peaceful atmosphere or in the late afternoon when the sunset offers a beautiful view."
                    ]
                },
                {
                    "intent": "ask_about_circumambulation",
                    "examples": [
                        "What is circumambulation at Boudhanath?",
                        "Why do people walk around Boudhanath?",
                        "what direction?"
                    ],
                    "responses": [
                        "Circumambulation is a spiritual practice where pilgrims walk around the stupa in a clockwise direction, chanting mantras and making offerings for blessings."
                    ]
                },
                {
                    "intent": "ask_about_meditation",
                    "examples": [
                        "Can I meditate at Boudhanath?",
                        "Is Boudhanath a good place for meditation?",
                        "meditation"
                    ],
                    "responses": [
                        "Yes, Boudhanath Stupa is an excellent place for meditation. The serene environment and spiritual atmosphere make it ideal for quiet reflection and mindfulness."
                    ]
                },
                {
                    "intent": "ask_about_pilgrims",
                    "examples": [
                        "How many pilgrims visit Boudhanath annually?",
                        "Are there many pilgrims at Boudhanath?"
                    ],
                    "responses": [
                        "Boudhanath Stupa attracts thousands of pilgrims every year, particularly during major Buddhist festivals such as Losar and Buddha Jayanti."
                    ]
                },
                {
                    "intent": "ask_about_significance_in_buddhism",
                    "examples": [
                        "Why is Boudhanath so significant in Buddhism?",
                        "What makes Boudhanath important in Buddhism?"
                    ],
                    "responses": [
                        "Boudhanath Stupa is one of the most important Buddhist sites in Nepal. It is believed to hold the relics of the Buddha and is a center of Tibetan Buddhist culture."
                    ]
                },
                {
                    "intent": "ask_about_nearby_restaurants",
                    "examples": [
                        "Are there any restaurants near Boudhanath?",
                        "What are some good places to eat near Boudhanath?"
                    ],
                    "responses": [
                        "There are many restaurants and cafes around Boudhanath Stupa offering Tibetan, Nepalese, and international cuisine. Popular options include The Tibetan Kitchen, Stupa View Restaurant, and Boudhanath Cafe."
                    ]
                }
            ]
        },
        {
            "intent": "about_swayambhunath",
            "examples": [
                "Tell me about Swayambhunath",
                "What is Swayambhunath?",
                "Swayambhunath",
                "swayambhu",
                "monkey temple"
            ],
            "responses": [
                "Swayambhunath, also known as the Monkey Temple, is an ancient religious complex atop a hill in the Kathmandu Valley. It is a UNESCO World Heritage Site and a sacred site for both Buddhists and Hindus."
            ],
            "more": [
                "Swayambhunath, also known as the Monkey Temple, is one of the most iconic religious sites in Nepal, located atop a hill overlooking the Kathmandu Valley. The stupa’s name 'Swayambhu' means 'self-existent,' referring to its miraculous origin. According to legend, it emerged from the center of the Kathmandu Valley, once a vast lake, as a divine lotus flower. \n The stupa itself features a large golden spire with Buddha's all-seeing eyes painted on all four sides, symbolizing the Buddha's omnipresence. The site also contains numerous shrines, statues, and stupas, blending Hindu and Buddhist elements. Visitors climb 365 steps to reach the stupa, offering stunning views of the valley. \n Swayambhunath has been a pilgrimage site for centuries, with both Buddhists and Hindus worshipping here. It is known for its monkeys, who roam the site and are considered sacred. The area is home to Tibetan Buddhist monasteries, offering insight into Buddhist culture and teachings.\n The site is a UNESCO World Heritage Site and a center for cultural events, religious festivals, and local traditions. It remains a peaceful and serene place, offering visitors a chance for reflection and spiritual connection, making it a must-visit destination in Kathmandu. "
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "swayambhu"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "ask_about_where_is_swayambhunath_located",
                    "examples": [
                        "Where is Swayambhunath located?",
                        "location"
                    ],
                    "responses": [
                        "Swayambhunath is located in Swayambhu, Kathmandu, Nepal.Swayambhunath is located approximately 2 kilometers west of Kathmandu Durbar Square, atop a hill in the Kathmandu Valley. It stands at an elevation of about 77 meters (253 feet) above the valley floor, offering panoramic views of the Kathmandu Valley. The site is accessible by a steep climb of 365 steps or by road, making it a prominent landmark in the city. "
                    ]
                },
                {
                    "intent": "ask_about_what_is_painted_on",
                    "examples": [
                        "What is painted on the stupa at Swayambhunath?",
                        "paint",
                        "eyes"
                    ],
                    "responses": [
                        "The stupa has Buddha's eyes and eyebrows painted on it."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_mythological",
                    "examples": [
                        "What is the mythological origin of Kathmandu Valley according to Swayambhu Purana?",
                        "origin"
                    ],
                    "responses": [
                        "Kathmandu Valley was once a lake from which a lotus grew; Manjushri drained the lake, turning the lotus into a hill, and the flower became the stupa."
                    ]
                },
                {
                    "intent": "ask_about_who_is_manjushri",
                    "examples": [
                        "Who is Manjushri?",
                        "manjushree",
                        "manjushri"
                    ],
                    "responses": [
                        "Manjushri is a prominent figure in Buddhist mythology and is considered a bodhisattva of wisdom. In Mahayana Buddhism, Manjushri represents the embodiment of wisdom and insight, often depicted wielding a sword that cuts through ignorance and delusion. The sword symbolizes the cutting away of confusion, revealing the truth of reality. Manjushri is also shown holding a book or scroll in his left hand, symbolizing the wisdom teachings.\n n the context of Tibetan Buddhism, Manjushri is highly revered and believed to have played a role in transmitting the Buddha's teachings. He is often invoked by practitioners seeking to enhance their understanding and develop wisdom."
                    ]
                },
                {
                    "intent": "ask_about_why_are_the_monkeys",
                    "examples": [
                        "Why are the monkeys at Swayambhunath considered holy?",
                        "monkeys"
                    ],
                    "responses": [
                        "They are considered holy because they are believed to have come from Manjushri’s head lice when he grew his hair long."
                    ]
                },
                {
                    "intent": "ask_about_who_is_believed_to",
                    "examples": [
                        "Who is believed to have founded Swayambhunath?",
                        "founder"
                    ],
                    "responses": [
                        "King Vrsadeva, the great-grandfather of King Mānadeva, is believed to have founded Swayambhunath in the 5th century CE."
                    ]
                },
                {
                    "intent": "ask_about_which_indian_emperor_is",
                    "examples": [
                        "Which Indian emperor is said to have visited Swayambhunath?"
                    ],
                    "responses": [
                        "Emperor Ashoka is said to have visited Swayambhunath in the 3rd century BCE."
                    ]
                },
                {
                    "intent": "ask_about_who_led_the_reconstruction",
                    "examples": [
                        "Who led the reconstruction of Swayambhunath in the 15th century?"
                    ],
                    "responses": [
                        "Śāriputra, an Indian Buddhist monk, led the reconstruction."
                    ]
                },
                {
                    "intent": "ask_about_which_kathmandu_king_constructed",
                    "examples": [
                        "Which Kathmandu king constructed the eastern stairway?"
                    ],
                    "responses": [
                        "King Pratap Malla constructed the eastern stairway in the 17th century."
                    ]
                },
                {
                    "intent": "ask_about_when_was_the_major",
                    "examples": [
                        "When was the major renovation of Swayambhunath completed?"
                    ],
                    "responses": [
                        "A major renovation was completed in May 2010."
                    ]
                },
                {
                    "intent": "ask_about_how_much_gold_was",
                    "examples": [
                        "How much gold was used to regild Swayambhunath during the 2010 renovation?"
                    ],
                    "responses": [
                        "20 kg of gold was used to regild Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_which_organization_funded_the",
                    "examples": [
                        "Which organization funded the 2010 renovation of Swayambhunath?"
                    ],
                    "responses": [
                        "The Tibetan Nyingma Meditation Center of California funded the renovation."
                    ]
                },
                {
                    "intent": "ask_about_what_happened_to_pratapur",
                    "examples": [
                        "What happened to Pratapur Temple in 2011?"
                    ],
                    "responses": [
                        "Pratapur Temple was damaged by a lightning strike in 2011."
                    ]
                },
                {
                    "intent": "ask_about_how_was_swayambhunath_affected",
                    "examples": [
                        "How was Swayambhunath affected by the 2015 Nepal earthquake?"
                    ],
                    "responses": [
                        "Swayambhunath suffered damage in the 2015 Nepal earthquake."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_components",
                    "examples": [
                        "What are the components of Swayambhunath's stupa?"
                    ],
                    "responses": [
                        "The stupa consists of a dome, a cube structure with Buddha's eyes, pentagonal toranas, thirteen tiers, and a Gajur at the top."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_dome",
                    "examples": [
                        "What does the dome at the base of the stupa symbolize?"
                    ],
                    "responses": [
                        "The dome represents the entire world."
                    ]
                },
                {
                    "intent": "ask_about_what_do_the_thirteen",
                    "examples": [
                        "What do the thirteen pinnacles on the stupa represent?"
                    ],
                    "responses": [
                        "The thirteen pinnacles symbolize the thirteen stages of spiritual realizations to reach enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_what_do_the_eyes",
                    "examples": [
                        "What do the eyes on the stupa represent?"
                    ],
                    "responses": [
                        "The eyes represent Wisdom and Compassion, known as the Eyes of Buddha."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_meaning",
                    "examples": [
                        "What is the meaning of the third eye on the stupa?"
                    ],
                    "responses": [
                        "The third eye symbolizes cosmic rays that emanate when Buddha preaches."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_curly",
                    "examples": [
                        "What does the curly symbol between the Buddha's eyes represent?"
                    ],
                    "responses": [
                        "It represents the Nepali number one, symbolizing unity and the path to enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_who_are_the_panch",
                    "examples": [
                        "Who are the Panch Buddhas?"
                    ],
                    "responses": [
                        "The Panch Buddhas are Vairochana, Akshobhya, Ratna Sambhava, Amitabha, and Amoghsiddhi."
                    ]
                },
                {
                    "intent": "ask_about_what_does_vairochana_represent",
                    "examples": [
                        "What does Vairochana represent?"
                    ],
                    "responses": [
                        "Vairochana represents the cosmic element of form and occupies the center."
                    ]
                },
                {
                    "intent": "ask_about_what_does_akshobhya_represent",
                    "examples": [
                        "What does Akshobhya represent?"
                    ],
                    "responses": [
                        "Akshobhya represents the cosmic element of consciousness and faces east."
                    ]
                },
                {
                    "intent": "ask_about_what_does_ratna_sambhava",
                    "examples": [
                        "What does Ratna Sambhava represent?"
                    ],
                    "responses": [
                        "Ratna Sambhava represents the cosmic element of sensation and faces south."
                    ]
                },
                {
                    "intent": "ask_about_what_does_amitabha_represent",
                    "examples": [
                        "What does Amitabha represent?"
                    ],
                    "responses": [
                        "Amitabha represents the cosmic element of perception and faces west."
                    ]
                },
                {
                    "intent": "ask_about_what_does_amoghsiddhi_represent",
                    "examples": [
                        "What does Amoghsiddhi represent?"
                    ],
                    "responses": [
                        "Amoghsiddhi represents the cosmic element of action and faces north."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_swayambhu",
                    "examples": [
                        "What is the Swayambhu Purana?"
                    ],
                    "responses": [
                        "Swayambhu Purana is a Buddhist scripture about the origin and development of Kathmandu Valley."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_swayambhu",
                    "examples": [
                        "What does the Swayambhu Purana describe?"
                    ],
                    "responses": [
                        "It describes the Buddhas who came to Kathmandu and the first and second Buddhas in Buddhism."
                    ]
                },
                {
                    "intent": "ask_about_which_kings_inscription_confirms",
                    "examples": [
                        "Which king's inscription confirms Swayambhunath's age?"
                    ],
                    "responses": [
                        "King Vrsadeva's inscription from 640 CE confirms its age."
                    ]
                },
                {
                    "intent": "ask_about_what_kind_of_monkeys",
                    "examples": [
                        "What kind of monkeys are found at Swayambhunath?"
                    ],
                    "responses": [
                        "Holy monkeys are found in the north-west parts of Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_which_hindu_deity_is",
                    "examples": [
                        "Which Hindu deity is associated with Swayambhunath?"
                    ],
                    "responses": [
                        "Harati Devi, the goddess of smallpox and children, is associated with Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_how_do_pilgrims_worship",
                    "examples": [
                        "How do pilgrims worship at Swayambhunath?"
                    ],
                    "responses": [
                        "Pilgrims ascend the eastern steps before dawn and perform clockwise circumambulations of the stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_significance",
                    "examples": [
                        "What is the significance of Swayambhunath to Newar Buddhists?"
                    ],
                    "responses": [
                        "Swayambhunath is the most sacred site for Buddhist Newars."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_tibetan",
                    "examples": [
                        "What is the Tibetan name for Swayambhunath and its meaning?"
                    ],
                    "responses": [
                        "The Tibetan name is 'Phags.pa Shing.kun,' meaning 'Sublime Trees.'"
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_main",
                    "examples": [
                        "What is the main structure of Swayambhunath called?"
                    ],
                    "responses": [
                        "The main structure is called a stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_do_the_eyes",
                    "examples": [
                        "What do the eyes painted on the stupa represent?"
                    ],
                    "responses": [
                        "The eyes represent wisdom and compassion."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_dome",
                    "examples": [
                        "What does the dome at the base of the stupa symbolize?"
                    ],
                    "responses": [
                        "The dome represents the entire world."
                    ]
                },
                {
                    "intent": "ask_about_who_is_believed_to",
                    "examples": [
                        "Who is believed to have visited Swayambhunath in the 3rd century BCE?"
                    ],
                    "responses": [
                        "Emperor Ashoka is believed to have visited in the 3rd century BCE."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_significance",
                    "examples": [
                        "What is the significance of the number thirteen on the stupa?"
                    ],
                    "responses": [
                        "The thirteen tiers symbolize the thirteen stages to enlightenment."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the Buddhist scripture associated with Swayambhunath?"
                    ],
                    "responses": [
                        "Swayambhu Purana is the Buddhist scripture associated with the site."
                    ]
                },
                {
                    "intent": "ask_about_who_led_the_reconstruction",
                    "examples": [
                        "Who led the reconstruction of the stupa in the 15th century?"
                    ],
                    "responses": [
                        "Śāriputra led the reconstruction in the 15th century."
                    ]
                },
                {
                    "intent": "ask_about_which_valley_was_swayambhunath",
                    "examples": [
                        "Which valley was Swayambhunath said to have emerged from according to mythology?"
                    ],
                    "responses": [
                        "It emerged from a lake that once filled the Kathmandu Valley."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the bodhisattva associated with the monkeys at Swayambhunath?"
                    ],
                    "responses": [
                        "Manjushri is the bodhisattva associated with the monkeys."
                    ]
                },
                {
                    "intent": "ask_about_what_major_event_damaged",
                    "examples": [
                        "What major event damaged the Swayambhunath complex in 2015?"
                    ],
                    "responses": [
                        "The 2015 Nepal earthquake damaged the complex."
                    ]
                },
                {
                    "intent": "ask_about_what_was_used_to",
                    "examples": [
                        "What was used to re-gild the Swayambhu Shrine in 2010?"
                    ],
                    "responses": [
                        "20 kg of gold was used to re-gild the shrine."
                    ]
                },
                {
                    "intent": "ask_about_which_king_is_associated",
                    "examples": [
                        "Which king is associated with building the eastern stairway?"
                    ],
                    "responses": [
                        "King Pratap Malla built the eastern stairway."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_nepali",
                    "examples": [
                        "What is the Nepali number depicted as a nose on the stupa?"
                    ],
                    "responses": [
                        "The Nepali number 'one' is depicted as a nose."
                    ]
                },
                {
                    "intent": "ask_about_how_many_pentagonal_toranas",
                    "examples": [
                        "How many pentagonal toranas are present above the cube structure?"
                    ],
                    "responses": [
                        "There are pentagonal toranas on all four sides."
                    ]
                },
                {
                    "intent": "ask_about_what_does_the_third",
                    "examples": [
                        "What does the third eye on the stupa represent?"
                    ],
                    "responses": [
                        "The third eye symbolizes cosmic rays and spiritual awakening."
                    ]
                },
                {
                    "intent": "ask_about_which_buddhist_tradition_mainly",
                    "examples": [
                        "Which Buddhist tradition mainly influences Swayambhunath’s iconography?"
                    ],
                    "responses": [
                        "Vajrayana tradition mainly influences its iconography."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_main",
                    "examples": [
                        "What is the main ritual practice performed by pilgrims at Swayambhunath?"
                    ],
                    "responses": [
                        "Pilgrims perform clockwise circumambulations around the stupa."
                    ]
                },
                {
                    "intent": "ask_about_which_bodhisattva_had_a",
                    "examples": [
                        "Which bodhisattva had a vision of the lotus at Swayambhu?"
                    ],
                    "responses": [
                        "Manjushri had a vision of the lotus at Swayambhu."
                    ]
                },
                {
                    "intent": "ask_about_which_empire’s_ruler_is",
                    "examples": [
                        "Which empire’s ruler is said to have built a temple on Swayambhunath hill?"
                    ],
                    "responses": [
                        "Emperor Ashoka of the Maurya Empire built a temple on the hill."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_alternative",
                    "examples": [
                        "What is the alternative name for Swayambhunath?"
                    ],
                    "responses": [
                        "It is also called Swayambhu or Swoyambhu."
                    ]
                },
                {
                    "intent": "ask_about_who_was_king_vṛsadeva,",
                    "examples": [
                        "Who was King Vṛsadeva, and what is his connection to Swayambhunath?"
                    ],
                    "responses": [
                        "King Vṛsadeva, the great-grandfather of King Mānadeva, is believed to have founded Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_shape",
                    "examples": [
                        "What is the shape of the stupa's base?",
                        "shape"
                    ],
                    "responses": [
                        "The base is dome-shaped."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_name",
                    "examples": [
                        "What is the name of the goddess temple located near the stupa?",
                        "what temple near stupa?"
                    ],
                    "responses": [
                        "Harati Devi's temple is near the stupa."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_panch",
                    "examples": [
                        "What are the Panch Buddhas, and where are they represented on the stupa?",
                        "5 buddhas",
                        "five buddhas"
                    ],
                    "responses": [
                        "Panch Buddhas represent five Buddhas, depicted on all four sides and at the base."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_daily",
                    "examples": [
                        "What are the daily practices observed by visitors to Swayambhunath?"
                    ],
                    "responses": [
                        "Visitors perform kora (circumambulation), light butter lamps, and offer prayers."
                    ]
                },
                {
                    "intent": "ask_about_what_are_the_opening",
                    "examples": [
                        "What are the opening hours of Swayambhunath?",
                        "opening hours",
                        "when does it open?"
                    ],
                    "responses": [
                        "Swayambhunath is open from early morning around 5 AM to 7 PM in the evening."
                    ]
                },
                {
                    "intent": "ask_about_what_is_the_entry",
                    "examples": [
                        "What is the entry fee for Swayambhunath?",
                        "entry fee"
                    ],
                    "responses": [
                        "Nepali citizens do not need to pay an entry fee to visit Swayambhunath but entry fee may differ to foreign citizens. Rs. 50 for SAARC nationals and Rs. 200 for others."
                    ]
                },
                {
                    "intent": "ask_about_how_can_i_reach",
                    "examples": [
                        "How can I reach Swayambhunath from Kathmandu city center?",
                        "how to go?",
                        "transportaion"
                    ],
                    "responses": [
                        "You can reach Swayambhunath via taxi, bus, or by walking from Kathmandu Durbar Square, approximately 3 km away."
                    ]
                },
                {
                    "intent": "ask_about_is_there_parking_available",
                    "examples": [
                        "Is there parking available near Swayambhunath?",
                        "parking"
                    ],
                    "responses": [
                        "Yes, there is parking available near the southern entrance of Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_how_many_steps_are",
                    "examples": [
                        "How many steps are there to climb to Swayambhunath?",
                        "steps"
                    ],
                    "responses": [
                        "There are approximately 365 steps leading up to Swayambhunath from the eastern side."
                    ]
                },
                {
                    "intent": "ask_about_are_there_restaurants_near",
                    "examples": [
                        "Are there restaurants near Swayambhunath?",
                        "foods",
                        "restaurants"
                    ],
                    "responses": [
                        "Yes, several small restaurants and cafes are located around Swayambhunath."
                    ]
                },
                {
                    "intent": "ask_about_is_photography_allowed_at",
                    "examples": [
                        "Is photography allowed at Swayambhunath?",
                        "photographs"
                    ],
                    "responses": [
                        "Yes, photography is allowed, but drones may require permission."
                    ]
                },
                {
                    "intent": "ask_about_can_i_buy_souvenirs",
                    "examples": [
                        "Can I buy souvenirs at Swayambhunath?"
                    ],
                    "responses": [
                        "Yes, there are many stalls selling souvenirs, prayer wheels, and handicrafts."
                    ]
                },
                {
                    "intent": "ask_about_are_there_any_nearby",
                    "examples": [
                        "Are there any nearby attractions to Swayambhunath?"
                    ],
                    "responses": [
                        "Nearby attractions include Kathmandu Durbar Square, Boudhanath Stupa, and Pashupatinath Temple."
                    ]
                }
            ]
        },
        {
            "intent": "patan_durbar_square",
            "examples": [
                "What is Patan Durbar Square?",
                "Where is Patan Durbar Square located?",
                "Why is Patan Durbar Square important?",
                "Patan Durbar Square"
            ],
            "responses": [
                "Patan Durbar Square is a historic site in the heart of Patan, known for its temples, palaces, and courtyards."
            ],
            "more": [
                "It is located in the center of Patan, near the Bagmati River and south of Kathmandu. Patan Durbar Square was the royal palace of the Malla kings and is an important center for art, culture, and architecture."
            ],
            "entities": [
                {
                    "entity": "place",
                    "option": "Patan"
                }
            ],
            "follow_up_questions": [
                {
                    "intent": "historical_and_cultural_significance",
                    "examples": [
                        "history and culture",
                        "history",
                        "history of patan durbar square"
                    ],
                    "responses": [
                        "Patan Durbar Square's establishment dates back to the Malla period, with the development of the square continuing over several centuries."
                    ]
                },
                {
                    "intent": "architecture",
                    "examples": [
                        "What are the main architectural highlights of Patan Durbar Square?",
                        "Can you tell me about the Hiranya Varna Mahavihar?",
                        "What is the significance of the Mahabouddha Temple?",
                        "architecture"
                    ],
                    "responses": [
                        "Key architectural highlights include the Hiranya Varna Mahavihar (Golden Temple), Mahabouddha Temple, and the ancient palace complex.",
                        "The Hiranya Varna Mahavihar is a Buddhist monastery known for its golden exterior and intricate carvings.",
                        "The Mahabouddha Temple, also known as the 'Temple of a Thousand Buddhas,' is famous for its unique brickwork."
                    ]
                },
                {
                    "intent": "points_of_interest",
                    "examples": [
                        "What museums can be found in Patan Durbar Square?",
                        "Golden Temple?"
                    ],
                    "responses": [
                        "Patan Durbar Square houses the Patan Museum, which showcases Nepalese art, architecture, and culture.",
                        "The Golden Temple is a significant Buddhist temple in Patan, known for its golden exterior and cultural importance."
                    ]
                },
                {
                    "intent": "faqs",
                    "examples": [
                        "How can I get to Patan Durbar Square?",
                        "What other attractions are near Patan Durbar Square?",
                        "Is Patan Durbar Square safe for tourists?",
                        "What is the best time to visit Patan Durbar Square?"
                    ],
                    "responses": [
                        "You can reach Patan Durbar Square by taxi, rickshaw, or on foot from central Kathmandu areas like Thamel.",
                        "Nearby attractions include Swayambhunath (Monkey Temple), Garden of Dreams, and Kathmandu Durbar Square.",
                        "Patan Durbar Square is generally safe for tourists, but it's always good to stay aware of your surroundings.",
                        "The best time to visit is during the autumn (September to November) and spring (March to May) seasons when the weather is pleasant."
                    ]
                },
                {
                    "intent": "trivia_and_fun_facts",
                    "examples": [
                        "What is a fun fact about Patan Durbar Square?",
                        "Are there any legends associated with Patan Durbar Square?",
                        "What are some lesser-known facts about Patan Durbar Square?",
                        "What unique traditions are associated with Patan Durbar Square?"
                    ],
                    "responses": [
                        "One unique tradition is the Kumari Jatra, where the living goddess Kumari is paraded around the square in a chariot.",
                        "The Golden Temple is built entirely of wood and has a golden exterior, making it one of the most beautiful structures in Patan.",
                        "Patan Durbar Square was the site of the coronation of many Malla kings.",
                        "The square is also known for its traditional Newar architecture and its stunning wooden carvings."
                    ]
                },
                {
                    "intent": "entry_fee_and_opening_hours",
                    "examples": [
                        "What is the entry fee for different visitors?",
                        "What are the opening hours?",
                        "opening hours"
                    ],
                    "responses": [
                        "Entry fees vary for foreigners, SAARC nationals, and locals. For SAARC nationals, the entry fee is NRs 150, and for foreigners, it is NRs 1000.",
                        "The square is open from 7 AM to 7 PM."
                    ]
                },
                {
                    "intent": "tips_for_visitors",
                    "examples": [
                        "What safety tips should visitors keep in mind?",
                        "What cultural etiquette should visitors follow?",
                        "What type of footwear is recommended for visiting Patan Durbar Square?",
                        "How should visitors respect the local culture at Patan Durbar Square?"
                    ],
                    "responses": [
                        "Visitors should be mindful of their belongings, especially during crowded festivals.",
                        "Respect local customs, dress modestly when visiting temples, and be aware of sacred spaces.",
                        "Wear comfortable shoes as the area is large and includes many temples and courtyards to explore.",
                        "Remove shoes when entering temples and behave respectfully toward local customs and traditions."
                    ]
                },
                {
                    "intent": "how_to_reach_patan_durbar_square",
                    "examples": [
                        "How accessible is Patan Durbar Square from various parts of the city?",
                        "Can you walk to Patan Durbar Square from Thamel?",
                        "How can you reach Patan Durbar Square by car or taxi?",
                        "What public transportation options are available to reach Patan Durbar Square?",
                        "Is it possible to reach Patan Durbar Square by bicycle?"
                    ],
                    "responses": [
                        "Patan Durbar Square is easily accessible from various parts of the city, including Thamel, by taxi, rickshaw, or walking.",
                        "You can walk from Thamel to Patan Durbar Square in about 20 minutes.",
                        "You can hire a car or taxi to take you close to the square; however, vehicles are not allowed inside the square area.",
                        "Public transportation is available, including buses and microbuses from Ratnapark, Sahid Gate, and nearby areas.",
                        "Yes, bicycles are allowed inside Patan Durbar Square, and you can rent a bike to explore the area."
                    ]
                },
                {
                    "intent": "fallback_follow_up",
                    "examples": [],
                    "responses": [
                        "I'm not sure what you're asking about Patan Durbar Square. Can you clarify?"
                    ]
                }
            ]
        }
    ]
}
